{"user_id": "\"f6d64b9132d744f487087cdb14b3525a\"", "user_timezone": "null", "current_step_details": "[]", "query": "\"paint a wall\"", "query_result": "[{\"_id\": \"8394\", \"_index\": \"wikihow-v3\", \"_score\": 12.877666, \"_source\": {\"QAs\": [[\"How soon can I put painter's tape on a painted surface?\", \"You should wait at least two days before putting painter's tape on a painted surface.\"], [\"Our living room was painted black and blood red. Will primer cover it?\", \"Yes, you don't have to worry about that. Primer paint should cover any colors on the wall.\"], [\"Start I at the top or bottom of a wall?\", \"Starting from one of the upper corners and working your way down will give you a much easier time, especially as you near the end of the project. Otherwise, you'll have to keep reaching higher and higher up, which can become difficult and make you more prone to mistakes if you're already tired from painting all day.\"], [\"My wall has a hole in it. Should I fill it first or do the cleaning process first?\", \"Always fill, caulk, patch and sand before you get into the cleaning phase. You want to make sure that the surface you're starting with is as flat and smooth as possible.\"], [\"What should I do for the best results if I want to paint a purple wall green?\", \"You should paint the wall white first and then do green. It will take a lot of coats to paint it white before painting it green. \"], [\"Do I paint light colors or dark colors first?\", \"Light colors first - easier to cover a mistake of a light color than dark colors.\"], [\"How much time should there be between patching, priming and painting?\", \"You can begin applying primer as soon as the caulk or putty is dry to the touch. Give fresh primer a couple hours to dry before you move on to painting. You should also wait a couple hours between each individual coat of paint to make sure the underlying coat has had time to set up properly.\"], [\"Is it better to thin paint with water or paint thinner?\", \"It depends largely on the type of paint you're using. Water-based paints, such as acrylics, can be cut with a small amount of water without losing smoothness or adhesion. Oil-based paints, on the other hand, should only be thinned with special chemical paint thinners. Make sure the thinner you choose is formulated for the specific type of paint you're using--latex paint thinners, for instance, should only be used on latex paints.\"], [\"What do I do if a few bubbles show up on a wall after I have sanded, wiped it down and painted it with primer?\", \"If they are hard bubbles use a hammer to break it and if they are soft push them down and if you use the hammer then make sure to use a flexy seel spray, then paint with primer and then real paint.\"], [\"Which is better for an interior wall, flat or semigloss? What is the difference?\", \"The type of paint you want is called eggshell. Flat paint is the kind of paint you'd use for a ceiling, while semigloss paint is used for things like door frames and trim. \"]], \"articleId\": 8394, \"articleTitle\": \"How to Paint a Wall\", \"articleUrl\": \"https://www.wikihow.com/Paint-a-Wall\", \"author\": {\"blurb\": \"General Contractor\", \"n_coauthors\": 28, \"name\": \"Mark Spelman\"}, \"hasParts\": true, \"hasSummary\": true, \"ingredients\": [], \"methods\": [[\"Start preparing the wall by locating any knobs, outlet covers, light switch faceplates, thermostats and other items along the wall and take them off. Starting with a smooth surface with no obstructions will help the project proceed much more efficiently.\\n\\nMost accents can simply be unscrewed and lifted off. Be sure to keep track of small pieces like faceplates and separator, and put the screws back where they belong.\\n\\nAny accents that you\\u2019re unable to remove can be covered with painter\\u2019s tape later on.\", \"Find a place to store nearby furniture, appliances and other belongings until you\\u2019ve wrapped up your project. If space is an issue, you can also simply scoot these items away from the wall you'll be painting. Be sure to cover any remaining furniture with a drop cloth or sheet of plastic to keep it protected.\\n\\nPaint can be virtually impossible to get out of upholstered fabrics, so it's a good idea to safeguard your furniture even if you think it's a safe distance away from the wall.\\nUnplug all electronics and relocate them somewhere where they won't be damaged.\", \"Stretch out a canvas drop cloth or plastic tarp that will help catch spills and splatters once you begin working. For maximum protection, the drop cloth should extend all the way to the base of the wall.\\n\\nPass up flimsy floor coverings like newsprint or bedsheets. These materials are usually too thin to stop wet paint from soaking through.\\n\\nThere\\u2019s no need to cover the entire floor. Just slide the drop cloth along as needed as you make your way from one end of the wall to the other.\", \"Wet a clean cloth or sponge with warm water and a mild liquid detergent, then wring out the excess moisture. Run the cloth over the walls from top to bottom to clear away dust and other debris that can interfere with the paint\\u2019s ability to set up properly.\\n\\nUse a light touch\\u2014you just want to clean the wall off, not totally soak it.\\nA small amount of diluted TSP (trisodium phosphate) will be useful for removing stuck-on dirt and grime from walls in dirtier areas like the kitchen or basement.\\n\\nIf there are any cracks or holes in the wall, fill those in before you prime or paint the wall.\\n\\nYou may also want to sand the wall before you paint it. This will help the paint adhere to the wall.\", \"Painter\\u2019s tape can be used to protect the trim at the top and bottom of the wall and around doorways. It will also come in handy for putting over accents that are a pain to remove, like dimmer switches. Make sure to line up the edges of the tape precisely, or you could end up with a lopsided paint job.\\n\\nYou can pick up painter\\u2019s tape from any home improvement store, as well as most major supermarkets and pharmacies.\\nLook for tape in different sizes. This will give you more flexibility over how to apply it and provide more coverage to keep paint from accidentally getting on other parts of the wall.\"], [\"For most jobs, a standard white primer will be your best bet. That way, the new paint color will be able to stand out. A gallon of primer should be enough to take care of most painting projects.\\n\\nAlways use a primer when painting interior walls. Not only will it help the paint stick, it will also cut down on the number of coats you have to apply to achieve the same depth of color.\\n\\nPrimer is especially useful when painting a lighter color over a darker color.\\nIf you're repainting a wall and you're using a paint and primer in one, you probably don't need to use a separate primer. However, if you're painting a large section of wall that's never been painted, prime it first.\", \"Apply an even coat from the floor to the ceiling, covering the broadest areas near the center of the wall. The base coat doesn\\u2019t need to be too thick\\u2014as long as it's smooth and consistent, the paint will sit easily on top of it.\\nTry not to leave any bare patches, as this type of inconsistency can affect the final color of the paint.\", \"Work the primer into tight crevices and other hard-to-reach areas with the tip of the brush. Pay particular attention to corners, alcoves and the spaces around the trim and wall fixtures. Try to match the thickness of the rolled sections as best you can.\\n\\nApply the primer using long, smooth strokes, then smooth it out by brushing it in multiple directions.\\nRemember to use your painter's tape for more precise lines and angles.\", \"Give the base coat about 4 hours to set. It should be dry to the touch before you begin applying subsequent coats of paint. It may be more convenient to apply the primer in the afternoon or evening, then wait until the following day to tackle the paint.\\n\\nPainting over wet primer can cause clouding and smudging, effectively ruining the coat.\\nKeeping your work area ventilated by opening a window or running an overhead fan or air conditioner will help the primer dry faster.\"], [\"When it comes to picking an interior paint, you have many options available to you. Consider not only color, but also the desired texture and finish you want for the wall. Pastels, for instance, can be used to brighten up the half-bath or sitting room, whereas darker shades can add a sense of size and dimension to communal areas like the kitchen.\\nStock up on enough paint to be able to finish the project without running out. A single gallon is usually enough to cover about 400 square feet of wall space.\", \"Use an electric paint mixer or handheld stirrer to blend the paint to an even consistency, even if it was mixed when you purchased it. This will prevent the oils and pigments from separating, result in better coverage and a smoother finish. Once the paint reaches a uniform texture throughout, it will be ready to go.\\n\\nTo cut down on sloshing and splattering, pour the paint into a larger bucket before you begin mixing.\\nMixing your paint prior to starting a big project is essential, whether you're using a brand new can or one that's been sitting on the shelf for a while.\", \"Dip the tip of your paintbrush about 2\\\" into the paint, letting the excess drip off. Then, brush the paint onto the wall with the angled edge of the brush, starting at one of the room\\u2019s upper corners. Follow along the painter\\u2019s tape and work your way down using smooth, linear strokes until you\\u2019ve completed the outer perimeter of the wall.\\n\\nPainting 2-3\\u201d outward from the trim will allow you to easily go over the rest using a roller.\\n\\nPause periodically to rewet your brush when your strokes become faint.\\nIt's a good idea to start by cutting in around the edges because this is the most difficult part of painting. If you do it first, you're still fresh, so you're less likely to make mistakes.\", \"After you\\u2019ve painted the wall\\u2019s outer edges, use a wide roller to take care of the middle. The best method for painting with a roller is to apply it in alternating \\\"M\\\" or \\u201cW\\u201d pattern, working back and forth over the same section until it\\u2019s completely filled in. You can then move onto another section, repeating the same pattern.\\n\\nAn extended roller handle can help you reach the upper sections of the wall nearest to the ceiling. Make sure to overlap the edges while painting.\\n\\nOnly use as much paint as you need to cover the primer. Oversaturating your roller can result in unsightly drips in the top coat.\", \"Depending on how deep you want the new color to come out, you can roll on a second or even third coat of paint. Paint these follow-up coats the same way, starting with the outer edges of the wall and working your way inward. Be sure to wait about 2-4 hours between coats to give the fresh paint time to dry.\\n\\nMost walls shouldn't require more than a couple coats of paint. However, extra coats may be useful for walls with coarse textures or when painting over a darker shade.\\n\\nTo avoid leaving obvious seams, make sure you go over the entire wall, including the area around the trim.\", \"Take one last look over the wall to check for thin spots, lumps, drips or other problem areas before calling it a day. Be prepared to give the top coat of paint at least twice as long to dry as you did the primer. In the meantime, try to resist the urge to touch the paint in order to prevent accidental smudges.\\n\\nIt usually takes somewhere between 24-48 hours for interior paint to cure completely.\\nDon\\u2019t forget to remove the painter\\u2019s tape once you\\u2019re satisfied with the look of the wall.\"]], \"methodsHeadlines\": [[\"Remove all accessories from the wall.\", \"Clear your work area of furniture.\", \"Lay down a drop cloth.\", \"Clean the surface of the wall gently.\", \"Cover adjacent surfaces with painter\\u2019s tape.\"], [\"Buy a bucket of primer.\", \"Roll the primer onto the wall.\", \"Use a handheld paintbrush to fill in the gaps.\", \"Let the primer dry completely.\"], [\"Choose the right type of paint.\", \"Mix the paint thoroughly.\", \"Begin painting at the trim by hand.\", \"Paint the interior of the wall.\", \"Apply additional coats.\", \"Allow the paint to set up overnight.\"]], \"methodsImages\": [[\"https://www.wikihow.com/images/thumb/9/9e/Paint-a-Wall-Step-1-Version-3.jpg/v4-460px-Paint-a-Wall-Step-1-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/5/5e/Paint-a-Wall-Step-2-Version-3.jpg/v4-460px-Paint-a-Wall-Step-2-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/5/5d/Paint-a-Wall-Step-3-Version-3.jpg/v4-460px-Paint-a-Wall-Step-3-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/6/61/Paint-a-Wall-Step-4-Version-2.jpg/v4-460px-Paint-a-Wall-Step-4-Version-2.jpg\", \"https://www.wikihow.com/images/thumb/5/51/Paint-a-Wall-Step-5-Version-3.jpg/v4-460px-Paint-a-Wall-Step-5-Version-3.jpg\"], [\"https://www.wikihow.com/images/thumb/a/a1/Paint-a-Wall-Step-6-Version-2.jpg/v4-460px-Paint-a-Wall-Step-6-Version-2.jpg\", \"https://www.wikihow.com/images/thumb/8/8c/Paint-a-Wall-Step-7-Version-2.jpg/v4-460px-Paint-a-Wall-Step-7-Version-2.jpg\", \"https://www.wikihow.com/images/thumb/1/1a/Paint-a-Wall-Step-8-Version-3.jpg/v4-460px-Paint-a-Wall-Step-8-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/d/d8/Paint-a-Wall-Step-9-Version-3.jpg/v4-460px-Paint-a-Wall-Step-9-Version-3.jpg\"], [\"https://www.wikihow.com/images/thumb/f/fa/Paint-a-Wall-Step-10.jpg/v4-460px-Paint-a-Wall-Step-10.jpg\", \"https://www.wikihow.com/images/thumb/3/3a/Paint-a-Wall-Step-11-Version-2.jpg/v4-460px-Paint-a-Wall-Step-11-Version-2.jpg\", \"https://www.wikihow.com/images/thumb/d/d6/Paint-a-Wall-Step-12-Version-3.jpg/v4-460px-Paint-a-Wall-Step-12-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/8/89/Paint-a-Wall-Step-13-Version-2.jpg/v4-460px-Paint-a-Wall-Step-13-Version-2.jpg\", \"https://www.wikihow.com/images/thumb/c/c1/Paint-a-Wall-Step-14-Version-3.jpg/v4-460px-Paint-a-Wall-Step-14-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/9/95/Paint-a-Wall-Step-15.jpg/v4-460px-Paint-a-Wall-Step-15.jpg\"]], \"methodsNames\": [\"Preparing Your Work Area\", \"Applying Primer\", \"Painting the Wall\"], \"otherLanguages\": {\"Bahasa Indonesia\": {\"title\": \"Mengecat Dinding\", \"url\": \"https://id.wikihow.com/Mengecat-Dinding\"}, \"Espa\\u00f1ol\": {\"title\": \"pintar una pared\", \"url\": \"https://es.wikihow.com/pintar-una-pared\"}, \"Fran\\u00e7ais\": {\"title\": \"peindre un mur\", \"url\": \"https://fr.wikihow.com/peindre-un-mur\"}, \"Italiano\": {\"title\": \"Tinteggiare una Parete\", \"url\": \"https://www.wikihow.it/Tinteggiare-una-Parete\"}, \"Nederlands\": {\"title\": \"Een muur schilderen\", \"url\": \"https://nl.wikihow.com/Een-muur-schilderen\"}, \"Portugu\\u00eas\": {\"title\": \"Pintar uma Parede\", \"url\": \"https://pt.wikihow.com/Pintar-uma-Parede\"}, \"Ti\\u1ebfng Vi\\u1ec7t\": {\"title\": \"S\\u01a1n t\\u01b0\\u1eddng\", \"url\": \"https://www.wikihow.vn/S%C6%A1n-t%C6%B0%E1%BB%9Dng\"}, \"\\u0420\\u0443\\u0441\\u0441\\u043a\\u0438\\u0439\": {\"title\": \"\\u043f\\u043e\\u043a\\u0440\\u0430\\u0441\\u0438\\u0442\\u044c \\u0441\\u0442\\u0435\\u043d\\u0443\", \"url\": \"https://ru.wikihow.com/%D0%BF%D0%BE%D0%BA%D1%80%D0%B0%D1%81%D0%B8%D1%82%D1%8C-%D1%81%D1%82%D0%B5%D0%BD%D1%83\"}, \"\\u0627\\u0644\\u0639\\u0631\\u0628\\u064a\\u0629\": {\"title\": \"\\u062f\\u0647\\u0646 \\u062d\\u0627\\u0626\\u0637\", \"url\": \"https://ar.wikihow.com/%D8%AF%D9%87%D9%86-%D8%AD%D8%A7%D8%A6%D8%B7\"}, \"\\u0939\\u093f\\u0928\\u094d\\u0926\\u0940\": {\"title\": \"\\u0926\\u0940\\u0935\\u093e\\u0930 \\u092a\\u0930 \\u092a\\u0947\\u0902\\u091f (paint) \\u0915\\u0930\\u0947\\u0902\", \"url\": \"https://hi.wikihow.com/%E0%A4%A6%E0%A5%80%E0%A4%B5%E0%A4%BE%E0%A4%B0-%E0%A4%AA%E0%A4%B0-%E0%A4%AA%E0%A5%87%E0%A4%82%E0%A4%9F-(paint)-%E0%A4%95%E0%A4%B0%E0%A5%87%E0%A4%82\"}, \"\\u65e5\\u672c\\u8a9e\": {\"title\": \"\\u58c1\\u306b\\u30da\\u30f3\\u30ad\\u3092\\u5857\\u308b\", \"url\": \"https://www.wikihow.jp/%E5%A3%81%E3%81%AB%E3%83%9A%E3%83%B3%E3%82%AD%E3%82%92%E5%A1%97%E3%82%8B\"}, \"\\ud55c\\uad6d\\uc5b4\": {\"title\": \"\\ubcbd\\uc5d0 \\ud398\\uc778\\ud2b8 \\uce60\\ud558\\ub294 \\ubc29\\ubc95\", \"url\": \"https://ko.wikihow.com/%EB%B2%BD%EC%97%90-%ED%8E%98%EC%9D%B8%ED%8A%B8-%EC%B9%A0%ED%95%98%EB%8A%94-%EB%B0%A9%EB%B2%95\"}}, \"quizzes\": [], \"rating\": 92, \"refs\": [\"http://www.homedepot.com/c/painting_techniques_for_interior_walls_HT_PG_PA\", \"http://www.bhg.com/decorating/paint/how-tos/how-to-ready-a-room/\", \"https://www.lowes.com/projects/paint-stain-and-wallpaper/prep-for-paint/project\", \"https://www.houselogic.com/remodel/painting-lighting/using-a-drop-cloth/\", \"http://www.popularmechanics.com/home/interior-projects/how-to/g151/13-painting-secrets-the-pros-wont-tell-you/\", \"https://www.realsimple.com/home-organizing/home-improvement/painting/paint-wall\", \"http://www.bhg.com/decorating/paint/how-tos/how-to-prep-paint/\", \"http://www.homedepot.com/c/painting_techniques_for_interior_walls_HT_PG_PA\", \"https://www.familyhandyman.com/painting/painting-how-to-choose-and-use-primers/view-all\"], \"relatedArticles\": [{\"img\": \"https://www.wikihow.com/images/thumb/8/8d/Choose-an-Accent-Wall-Step-15.jpg/-crop-342-184-245px-Choose-an-Accent-Wall-Step-15.jpg\", \"title\": \"How to Choose an Accent Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fa/Mist-Coat-with-Paint-Step-12.jpg/-crop-342-184-245px-Mist-Coat-with-Paint-Step-12.jpg\", \"title\": \"How to Mist Coat with Paint\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/f0/Skim-Coat-Step-20.jpg/-crop-342-184-245px-Skim-Coat-Step-20.jpg\", \"title\": \"How to Skim Coat\"}, {\"img\": null, \"title\": \"How to Paint over Varnish\"}, {\"img\": \"https://www.wikihow.com/images/thumb/4/44/Stain-Brick-Step-16.jpg/-crop-342-184-245px-Stain-Brick-Step-16.jpg\", \"title\": \"How to Stain Brick\"}, {\"img\": \"https://www.wikihow.com/images/thumb/b/bc/Paint-a-Concrete-Wall-Step-8.jpg/-crop-342-184-295px-Paint-a-Concrete-Wall-Step-8.jpg\", \"title\": \"How to Paint a Concrete Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fb/Paint-Your-Basement-Walls-Step-18.jpg/-crop-342-184-245px-Paint-Your-Basement-Walls-Step-18.jpg\", \"title\": \"How to Paint Your Basement Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/6/65/Paint-Walls-Near-a-Ceiling-Step-20.jpg/-crop-342-184-245px-Paint-Walls-Near-a-Ceiling-Step-20.jpg\", \"title\": \"How to Paint Walls Near a Ceiling\"}, {\"img\": null, \"title\": \"How to Paint an Interior Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1b/Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg/-crop-342-184-245px-Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg\", \"title\": \"How to Hide Wall Flaws with Textured Paint\"}, {\"img\": \"https://www.wikihow.com/images/thumb/e/ed/Whitewash-Walls-Step-9.jpg/-crop-342-184-245px-Whitewash-Walls-Step-9.jpg\", \"title\": \"How to Whitewash Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/7/7b/Paint-Sheetrock-Step-12.jpg/-crop-342-184-276px-Paint-Sheetrock-Step-12.jpg\", \"title\": \"How to Paint Sheetrock\"}, {\"img\": \"https://www.wikihow.com/images/thumb/a/a0/Paint-Baseboards-Step-12.jpg/-crop-342-184-245px-Paint-Baseboards-Step-12.jpg\", \"title\": \"How to Paint Baseboards\"}, {\"img\": \"https://www.wikihow.com/images/thumb/0/01/Paint-Straight-Lines-Step-17.jpg/-crop-342-184-245px-Paint-Straight-Lines-Step-17.jpg\", \"title\": \"How to Paint Straight Lines\"}], \"summaryText\": \"When the walls of your home are in desperate need of a new color palette, you might be tempted to just pick up a brush and go. But before you do, it will be helpful to be aware of a few painting fundamentals that can save you valuable time and effort. The key to achieving a smooth, seamless finish lies in the preparation\\u2014after cleaning the wall and applying a base coat of primer, you can direct your attention to the outer edges of the wall and work your way inward using a color that makes the room irresistible to the eye.\", \"summaryVideoUrl\": \"https://www.wikihow.com/Video/Paint-a-Wall\", \"tipsWarnings\": [\"Between priming, painting and drying time, painting interior walls can become a lengthy task. Schedule your project for a weekend or off day so you\\u2019ll have plenty of time to work unhurried.\", \"Fill in holes and smooth out inconsistencies around the trim, corners or spackling using high-grit sandpaper before applying the primer.\", \"Multiply the length of the room by the width in feet to find out exactly how much paint you\\u2019ll need for big interior projects.\", \"For more exact color-matching, try tinting your primer by stirring in a small amount of the paint you\\u2019ll be using for your top coat.\", \"Pull off the painter\\u2019s tape while the paint is still wet to keep it from cracking or peeling.\", \"If you're painting walls, you might also want to consider painting your doors while you're at it.\"], \"tools\": [[\"Interior paint\", \"Primer\", \"Paint roller\", \"Soft bristled handheld paintbrush\", \"Canvas or plastic dropcloths\", \"Painter's tape\", \"Water\", \"Mild liquid detergent\", \"Clean cloth or sponge\", \"Trisodium phosphate (optional)\", \"Extending roller handle (optional)\", \"Plastic furniture covers (optional)\"]], \"topLevelCategories\": [\"Home and Garden\", \"DIY\"], \"updated\": \"November 22, 2019\", \"views\": 608312, \"votes\": 67}, \"_type\": \"_doc\", \"original_rank\": 0, \"reranking_score\": 7.563070297241211}, {\"_id\": \"92462\", \"_index\": \"wikihow-v3\", \"_score\": 11.15006, \"_source\": {\"QAs\": [[\"What should be used to dilute the paint before painting inner ir outer wall?\", \"Do not dilute latex paint. Sometimes, you can add a penetrol for oil paints.\"], [\"What happens if I apply primer and emulsion without applying putty?\", \"The wall will not be as smooth and you will see the painted-over cracks and divots.\"], [\"Why should I mix primer and paint if I have applied a coat of primer prior to painting?\", \"Don't mix them together, just make sure they are each well mixed before using each one separately. \"], [\"Will white under coat cover orange paint that is on the wall?\", \"Yes, with enough coats, but before application you should read the Technical Data Sheet for manufactures' instruction. \"], [\"Can I paint over very dirty walls and ceilings? I attempted to clean walls in one room and ended up with a smeared mess. What can I do?\", \"Clean the mess. Then, try painting with a different type of paint. Maybe you could try painting multiple layers of paint instead of only one. \"], [\"How do I repaint a plastic emulsion painted wall?\", \"First, sand the painted wall with 220 sandpaper, then apply sealer/primer and top coat. For a peeling area, remove the peeled paint and then apply putty, sand it down, then apply sealer/primer and top coat.\"], [\"How do I make designs on a white painted wall?\", \"Use painter's tape to make the lines, then fill in the spaces with the color(s) of your choice. If it is a picture, you have to paint it freehand or create a stencil.\"], [\"After painting the wall, can I paste stickers on it?\", \"The wall should, of course, be dry before applying stickers. It is wise to choose wall stickers intended for this purpose, as stickers not intended for this could remove parts of the paint if you intend to remove them afterwards.\"], [\"When should I remove the masking tape around the edges after painting an interior wall?\", \"Painter's tape can stay on for a few days, but it would be best to remove the tape when the wall is completed. It doesn't have to be dry. If you\\u2019ve got a lot of paint on the tape, the sooner it\\u2019s removed the better. Peel the tape back over itself. \"], [\"Can I dilute  primer with water?\", \"No. You should never thin primer or paint. It is at the perfect thickness out of the can. Thinning attempts may cause it to stop being effective.\"]], \"articleId\": 92462, \"articleTitle\": \"How to Paint an Interior Wall\", \"articleUrl\": \"https://www.wikihow.com/Paint-an-Interior-Wall\", \"author\": {\"blurb\": \"General Contractor\", \"n_coauthors\": 11, \"name\": \"Mark Spelman\"}, \"hasParts\": true, \"hasSummary\": true, \"ingredients\": [], \"methods\": [[\"Before you start painting, you will need to cover your floor with a painter's canvas. Move and/or cover any furniture or other valuables in the room using painter's plastic. You can move your furniture to the center of the room and place a tarp or canvas cloth under the wall that you will be painting.\\nPlace your painting materials on the tarp and keep them there at all times. Do not put brushes, paint buckets, or paint trays on your bare floors or on other bare surfaces.\", \"Painting in a straight line can be difficult, so if this is your first time painting, then you will probably need to apply blue painter\\u2019s tape to the edges of your walls and any molding or fixtures. Apply the painter\\u2019s tape so that it is even with the edges of the walls, molding, and fixtures.\\nKeep in mind that you do not need to press hard on the tape when you apply it. Using a bit of gentle pressure will be enough to keep it in place.\", \"Before you use your primer or paint, take a moment to mix them well with a mixing stick. This will help to ensure that the pigments in the primer and paint are evenly distributed.\\nNever shake your paint cans. This can cause dry paint chips from the lid to mix into the paint. Always stir it with a mixing stick.\", \"For example, you can.\\nSand patched and/or rough surfaces smooth using 220-grit sandpaper. Vacuum or wipe away dust when you are done.\"], [\"Do not overfill the tray to the point that the angled part of the tray with ridges is covered with primer. You will only need an inch or two or primer in the tray.\\n\\nYou can use a cheap tray liner to line the tray so that you do not need to use multiple trays.\\nBe sure to pour the primer into your tray over the tarp or you may drip primer onto your floors.\\nYou only need to apply primer on walls made out of fresh drywall or bare wood. Keep in mind that primer will take up to a day to dry before you can paint.\", \"Dip your paintbrush in the primer bucket and then begin painting a straight line along the outer edge of one side of your wall. Paint along the edges in small sections and go slowly.\\n\\nTry to make the line as straight and even as possible. You may need to go over the line a couple of times to ensure that the primer is even.\\nUsing your paintbrush, try to cover about three to four inches of the outer edge of the wall with primer. This will make it easier to cover the rest of the wall with primer.\\nYou will need a stepladder to reach the edges along the top parts of your wall. Make sure that the step ladder is sturdy and consider asking someone to spot you.\", \"Place the paint roller into the primer and roll the roller back and forth a few times. The roller should be coated evenly with a thick layer of primer, but not dripping primer when you pick it up.\\nConsider using a roller with an extension rather than a step ladder for this part. A roller with an extension is safer and it will also make your job a bit easier.\", \"When you are ready to begin covering the wall with primer, take your roller and apply primer in a large \\u201cW\\u201d shape. Then, begin using smooth up and down motions to filling the area around the \\u201cW.\\u201d Keep painting until the area is completely and evenly covered with primer.\\n\\nRepeat the process on another section. Keep applying your primer in a \\u201cW\\u201d shape and filling in the areas around the \\u201cW\\u201d shapes until you have applied primer to the entire wall or room. Work on one portion of the wall at a time to ensure the best coverage.\\nDo not apply too much pressure when you apply the primer. Pressing hard on the roller may result in primer running down your wall and this can leave lines.\", \"Before you start to apply your paint, you will need to let the primer dry completely. Leaving it to dry for about one day is a safe amount of time. However, if the primer still seems wet after one day, give it another day.\"], [\"When you are ready to begin painting the walls, change your tray liner in the tray or get a new tray. Then, pour about one to two inches of paint into your tray.\\nUse your paintbrush to wipe off any excess paint that runs down the sides and into the rim of the paint bucket.\", \"When you are ready to begin painting, dip your paintbrush into the paint. It should be well-coated in paint, but not dripping. When you are ready, start painting along the edges of your walls and fixtures. Try to create straight even lines.\\n\\nKeep in mind that you may need to go over the paint a few times to ensure that it is even. Take your time and do one small area at a time.\\nRemember that you can always apply painter\\u2019s tape to the fixtures and edges if you are worried about not being able to paint in a straight line.\\nContinue to line the edges and fixtures until they are all covered in an even layer of paint.\", \"When you have finished painting around the edges and fixtures, you can start to fill in the center of your walls. Start by dipping your roller in the paint and covering the wall by making up and down motions, making sure to overlap the painted edges. Your roller should be covered in an even layer of paint, but it should not be dripping with paint.\\nDo not lift the roller until you finish covering the area.\", \"The paint will need at least one day to dry, so leave it be. Do not try to replace pictures, furniture, or other items until the paint is totally dry. You may also want to block entrance to the room to ensure that no small children or pets can come into the room and touch the walls.\\n\\nMost walls will need two coats of paint, and some darker colors may need three. Wait until the first coat is dry before applying the second coat.\\nIf the room is not well ventilated, then placing a fan in the room and cracking a window will help to keep the air circulating and help the paint to dry faster.\"]], \"methodsHeadlines\": [[\"Protect your floor and furniture.\", \"Apply painter\\u2019s tape to the edges.\", \"Mix your primer and paint.\", \"Prep your walls.\"], [\"Pour primer into the paint tray.\", \"Line the outer edges of your walls with primer.\", \"Coat the roller in primer.\", \"Apply primer in a large \\u201cW\\u201d shape.\", \"Allow the primer to dry for one day.\"], [\"Pour your paint into the tray.\", \"Begin lining the edges of the wall.\", \"Apply paint in up and down motions.\", \"Allow the paint to dry.\"]], \"methodsImages\": [[\"https://www.wikihow.com/images/thumb/2/2e/Paint-an-Interior-Wall-Step-1-Version-3.jpg/v4-460px-Paint-an-Interior-Wall-Step-1-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/9/97/Paint-an-Interior-Wall-Step-2-Version-3.jpg/550px-nowatermark-Paint-an-Interior-Wall-Step-2-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/4/42/Paint-an-Interior-Wall-Step-3-Version-3.jpg/v4-460px-Paint-an-Interior-Wall-Step-3-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/4/4e/Paint-an-Interior-Wall-Step-4-Version-3.jpg/v4-460px-Paint-an-Interior-Wall-Step-4-Version-3.jpg\"], [\"https://www.wikihow.com/images/thumb/6/6d/Paint-an-Interior-Wall-Step-5-Version-3.jpg/v4-460px-Paint-an-Interior-Wall-Step-5-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/f/fa/Paint-an-Interior-Wall-Step-6-Version-3.jpg/550px-nowatermark-Paint-an-Interior-Wall-Step-6-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/5/59/Paint-an-Interior-Wall-Step-7-Version-3.jpg/550px-nowatermark-Paint-an-Interior-Wall-Step-7-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/2/2d/Paint-an-Interior-Wall-Step-8-Version-3.jpg/550px-nowatermark-Paint-an-Interior-Wall-Step-8-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/9/90/Paint-an-Interior-Wall-Step-9-Version-3.jpg/550px-nowatermark-Paint-an-Interior-Wall-Step-9-Version-3.jpg\"], [\"https://www.wikihow.com/images/thumb/e/ea/Paint-an-Interior-Wall-Step-10-Version-3.jpg/v4-460px-Paint-an-Interior-Wall-Step-10-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/2/21/Paint-an-Interior-Wall-Step-11-Version-3.jpg/550px-nowatermark-Paint-an-Interior-Wall-Step-11-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/b/b5/Paint-an-Interior-Wall-Step-12-Version-2.jpg/v4-460px-Paint-an-Interior-Wall-Step-12-Version-2.jpg\", \"https://www.wikihow.com/images/thumb/c/cc/Paint-an-Interior-Wall-Step-13-Version-2.jpg/550px-nowatermark-Paint-an-Interior-Wall-Step-13-Version-2.jpg\"]], \"methodsNames\": [\"Setting Up Your Paint Surfaces and Materials\", \"Priming the Wall\", \"Painting the Wall\"], \"otherLanguages\": {\"Deutsch\": {\"title\": \"Eine Innenwand streichen\", \"url\": \"https://de.wikihow.com/Eine-Innenwand-streichen\"}, \"Espa\\u00f1ol\": {\"title\": \"pintar una pared en el interior\", \"url\": \"https://es.wikihow.com/pintar-una-pared-en-el-interior\"}, \"Fran\\u00e7ais\": {\"title\": \"peindre un mur int\\u00e9rieur\", \"url\": \"https://fr.wikihow.com/peindre-un-mur-int%C3%A9rieur\"}, \"Portugu\\u00eas\": {\"title\": \"Pintar uma Parede Interior\", \"url\": \"https://pt.wikihow.com/Pintar-uma-Parede-Interior\"}, \"\\u0420\\u0443\\u0441\\u0441\\u043a\\u0438\\u0439\": {\"title\": \"\\u043f\\u043e\\u043a\\u0440\\u0430\\u0441\\u0438\\u0442\\u044c \\u0432\\u043d\\u0443\\u0442\\u0440\\u0435\\u043d\\u043d\\u044e\\u044e \\u0441\\u0442\\u0435\\u043d\\u0443\", \"url\": \"https://ru.wikihow.com/%D0%BF%D0%BE%D0%BA%D1%80%D0%B0%D1%81%D0%B8%D1%82%D1%8C-%D0%B2%D0%BD%D1%83%D1%82%D1%80%D0%B5%D0%BD%D0%BD%D1%8E%D1%8E-%D1%81%D1%82%D0%B5%D0%BD%D1%83\"}}, \"quizzes\": [], \"rating\": 88, \"refs\": [\"Videos provided by RussOlinatz\", \"http://www.todayshomeowner.com/homeowners-guide-paint-primer/\", \"http://www.popularmechanics.com/home/how-to/g110/interior-painting-tips-how-to-paint-your-walls-like-a-pro/\", \"https://www.youtube.com/watch?v=XnLWhYxfgGQ\", \"https://www.youtube.com/watch?v=XnLWhYxfgGQ\", \"https://www.youtube.com/watch?v=pIL3Bpqtioc\", \"http://www.popularmechanics.com/home/how-to/g110/interior-painting-tips-how-to-paint-your-walls-like-a-pro/\", \"https://www.youtube.com/watch?v=pIL3Bpqtioc\", \"https://www.youtube.com/watch?v=pIL3Bpqtioc\"], \"relatedArticles\": [{\"img\": \"https://www.wikihow.com/images/thumb/0/0c/Choose-Interior-Paint-Colors-Step-19-Version-2.jpg/-crop-342-184-245px-Choose-Interior-Paint-Colors-Step-19-Version-2.jpg\", \"title\": \"How to Choose Interior Paint Colors\"}, {\"img\": \"https://www.wikihow.com/images/thumb/9/95/Paint-a-Wall-Step-15.jpg/-crop-342-184-245px-Paint-a-Wall-Step-15.jpg\", \"title\": \"How to Paint a Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/8/8d/Choose-an-Accent-Wall-Step-15.jpg/-crop-342-184-245px-Choose-an-Accent-Wall-Step-15.jpg\", \"title\": \"How to Choose an Accent Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fa/Mist-Coat-with-Paint-Step-12.jpg/-crop-342-184-245px-Mist-Coat-with-Paint-Step-12.jpg\", \"title\": \"How to Mist Coat with Paint\"}, {\"img\": null, \"title\": \"How to Paint over Varnish\"}, {\"img\": \"https://www.wikihow.com/images/thumb/4/44/Stain-Brick-Step-16.jpg/-crop-342-184-245px-Stain-Brick-Step-16.jpg\", \"title\": \"How to Stain Brick\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/f0/Skim-Coat-Step-20.jpg/-crop-342-184-245px-Skim-Coat-Step-20.jpg\", \"title\": \"How to Skim Coat\"}, {\"img\": \"https://www.wikihow.com/images/thumb/b/bc/Paint-a-Concrete-Wall-Step-8.jpg/-crop-342-184-295px-Paint-a-Concrete-Wall-Step-8.jpg\", \"title\": \"How to Paint a Concrete Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fb/Paint-Your-Basement-Walls-Step-18.jpg/-crop-342-184-245px-Paint-Your-Basement-Walls-Step-18.jpg\", \"title\": \"How to Paint Your Basement Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/6/65/Paint-Walls-Near-a-Ceiling-Step-20.jpg/-crop-342-184-245px-Paint-Walls-Near-a-Ceiling-Step-20.jpg\", \"title\": \"How to Paint Walls Near a Ceiling\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1b/Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg/-crop-342-184-245px-Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg\", \"title\": \"How to Hide Wall Flaws with Textured Paint\"}, {\"img\": \"https://www.wikihow.com/images/thumb/e/ed/Whitewash-Walls-Step-9.jpg/-crop-342-184-245px-Whitewash-Walls-Step-9.jpg\", \"title\": \"How to Whitewash Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/a/a0/Paint-Baseboards-Step-12.jpg/-crop-342-184-245px-Paint-Baseboards-Step-12.jpg\", \"title\": \"How to Paint Baseboards\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1c/Emulsion-Walls-Step-19.jpg/-crop-342-184-245px-Emulsion-Walls-Step-19.jpg\", \"title\": \"How to Emulsion Walls\"}], \"summaryText\": \"Painting a room is one of the easiest, and least expensive ways to freshen up or completely change the look of a room. Interior painting can be a simple and cost-effective do-it-yourself project, however proper preparation of your paint surfaces is important. Priming is crucial if you want a professional finish, since painting without priming can lead to an uneven appearance as well as cracking and peeling.[1]\\nX\\nResearch source\\n\\n When it comes time to paint, following some simple strategies will help to ensure that your wall looks as polished as possible.\", \"summaryVideoUrl\": null, \"tipsWarnings\": [\"Always use the recommended number of coats and allow the recommended amount of drying time between coats.\", \"Use one paint tray for each color, or buy disposable plastic paint tray liners and use a different one for each color.\", \"For best results when painting with colors, test the paint color on a small area of the wall during the day to see how the color will look before painting the entire room.\", \"Latex primer is the best choice for interior surfaces, such as drywall. It dries faster than oil or shellac primers and it is also more durable.[12]\\nX\\nResearch source\"], \"tools\": [[\"Plastic sheet or canvas\", \"Bucket\", \"Blue painter's tape (do not use masking tape)\", \"Patching or joint compound, if needed to repair cracks or holds\", \"220 grit sandpaper\", \"Primer\", \"Paint\", \"Paint tray\", \"Paint roller\", \"1 to 2 inch (2.54 cm to 5.08 cm) angled paintbrush\", \"Ladder\"]], \"topLevelCategories\": [\"Home and Garden\", \"DIY\"], \"updated\": \"September 18, 2019\", \"views\": 147964, \"votes\": 17}, \"_type\": \"_doc\", \"original_rank\": 14, \"reranking_score\": 6.9786458015441895}, {\"_id\": \"92477\", \"_index\": \"wikihow-v3\", \"_score\": 11.304234, \"_source\": {\"QAs\": [], \"articleId\": 92477, \"articleTitle\": \"How to Prepare a Wall for Paint\", \"articleUrl\": \"https://www.wikihow.com/Prepare-a-Wall-for-Paint\", \"author\": {\"blurb\": \"Full Service Contractor & Owner, Cherry Design + Build\", \"n_coauthors\": 8, \"name\": \"Sam Adams\"}, \"hasParts\": false, \"hasSummary\": true, \"ingredients\": [], \"methods\": [[\"Get someone to help you if any of the furniture is too heavy to lift on your own. Store any large items that you will not be removing in the center of the room, as far away from the walls as possible.\\nIf you leave any furniture in the room cover everything with old sheets, plastic, or tarps to protect it.\", \"Take down all artwork and unscrew and remove any hardware or shelving attached to the walls. Remove all curtains and blinds and any light fixtures and store them out of the room.\\nIt is a good idea to store loose screws and any hardware that you will reuse in plastic bags so that you don\\u2019t lose anything.\", \"Store all the cover plates with their corresponding screws in plastic bags to reattach after painting. Cover the remaining light switches and plug sockets with painter\\u2019s tape prior to painting.\", \"Prepare the walls for cleaning by dusting them off with a dry cloth first.\", \"Mix 2 gallons of water in a bucket with 1-2 cups of white vinegar and half a tablespoon of dish detergent. Dampen the sponge or cloth with the solution, wring it out well, and work from top to bottom of the wall.\\n\\nA mild grease-fighting liquid dish detergent works best to remove dirt and stains.\\nIt is a good idea to have a clean dry cloth handy as well to catch any drips and avoid streaks.\", \"Cover things like edges of windows and doors as well as all baseboards and trim that you will not be painting over. \\n\\nBlue painter\\u2019s tape is different from regular masking tape because it is specifically designed to be easily removed from walls after painting.\\nYou can run a clean putty knife over the tape to stick it down firmly.\\nYou may want to cover windows completely with plastic or kraft paper to protect the glass from accidental paint spatter.\\nTry to remove tape as soon as possible after painting, while it is still drying, to avoid taking any dry paint off with it.\", \"Lay out thick plastic, canvas or kraft paper drop sheets wherever you will be painting to cover the floor. Attach the edges of the drop sheets to the baseboards and floor using your painter\\u2019s tape.\"], [\"Before filling anything, remove any loose paint or plaster by gently scraping around holes and cracks so that you can see the whole damaged area.\\nIf there are any extremely small cracks, make them a bit wider with the edge of your blade to allow the filler to enter more easily.\", \"Wet a small paintbrush with water and dampen the edges of the hole or crack you are preparing to fill. This will prevent shrinkage of the filler by causing it to dry more slowly.\", \"Put an appropriate amount of filler onto a putty knife and apply it to the crack or hole by pressing the knife blade gently against the area.\\n\\nTry to cover the surface as evenly as possible by only moving the blade in one direction.\\nWipe away any excess putty to avoid an uneven surface when it dries.\", \"After the filling is completely dry, gently sand the area with 80-grit sandpaper to remove excess putty and smooth the surface.\", \"Use a small paintbrush to add a coat of primer just on the areas where you filled and sanded down holes or cracks to cover up the dried filler.\"], [\"Gently sand all over the walls that you are going to paint using circular motions. Try to sand all areas as evenly as possible. \\nThis will give the walls a rougher texture that will allow the paint to adhere better.\", \"Use your hands to feel the walls as you work and determine if there are any uneven areas or bumps. Spend extra time on these areas to make sure they are even with the rest of the wall.\", \"When you are happy with the texture of the walls, clean up as much of the dust from sanding as possible with a vacuum.\\nYou can use a hose attachment on your vacuum to easily and thoroughly go over the walls.\", \"Wipe down the walls one last time with a clean damp cloth to remove any last remainders of dust clinging to the walls.\"]], \"methodsHeadlines\": [[\"Move furniture out of the room.\", \"Clear the walls of all decorations, hardware, and fixtures.\", \"Unscrew light switch plates and electrical outlet covers.\", \"Wipe off dirt and dust with a clean dry cloth.\", \"Wipe down walls with a clean sponge or cloth and a mild soap solution.\", \"Mask anything you do not want to get paint on with blue painter\\u2019s tape.\", \"Put down drop sheets on the floor.\"], [\"Use a scraper or putty knife to scrape the area around holes or cracks.\", \"Dampen the area around the damage with a small paintbrush.\", \"Put filler in cracks and holes using a putty knife.\", \"Wait for the filler to dry and smooth out the repaired areas with sandpaper.\", \"Prime over repaired areas with a tinted primer.\"], [\"Sand walls using 80-grit sandpaper and a sanding block.\", \"Search for bumps or uneven textures.\", \"Vacuum walls from ceiling to floor.\", \"Wipe down walls with a damp cloth.\"]], \"methodsImages\": [[\"https://www.wikihow.com/images/thumb/e/ea/Prepare-a-Wall-for-Paint-Step-1.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-1.jpg\", \"https://www.wikihow.com/images/thumb/a/aa/Prepare-a-Wall-for-Paint-Step-2.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-2.jpg\", \"https://www.wikihow.com/images/thumb/f/fa/Prepare-a-Wall-for-Paint-Step-3.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-3.jpg\", \"https://www.wikihow.com/images/thumb/1/17/Prepare-a-Wall-for-Paint-Step-4.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-4.jpg\", \"https://www.wikihow.com/images/thumb/e/e1/Prepare-a-Wall-for-Paint-Step-5.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-5.jpg\", \"https://www.wikihow.com/images/thumb/6/67/Prepare-a-Wall-for-Paint-Step-6.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-6.jpg\", \"https://www.wikihow.com/images/thumb/e/e9/Prepare-a-Wall-for-Paint-Step-7.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-7.jpg\"], [\"https://www.wikihow.com/images/thumb/e/ed/Prepare-a-Wall-for-Paint-Step-8.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-8.jpg\", \"https://www.wikihow.com/images/thumb/b/b4/Prepare-a-Wall-for-Paint-Step-9.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-9.jpg\", \"https://www.wikihow.com/images/thumb/f/f8/Prepare-a-Wall-for-Paint-Step-10.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-10.jpg\", \"https://www.wikihow.com/images/thumb/6/6d/Prepare-a-Wall-for-Paint-Step-11.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-11.jpg\", \"https://www.wikihow.com/images/thumb/4/42/Prepare-a-Wall-for-Paint-Step-12.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-12.jpg\"], [\"https://www.wikihow.com/images/thumb/f/fe/Prepare-a-Wall-for-Paint-Step-13.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-13.jpg\", \"https://www.wikihow.com/images/thumb/b/b6/Prepare-a-Wall-for-Paint-Step-14.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-14.jpg\", \"https://www.wikihow.com/images/thumb/d/de/Prepare-a-Wall-for-Paint-Step-15.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-15.jpg\", \"https://www.wikihow.com/images/thumb/8/83/Prepare-a-Wall-for-Paint-Step-16.jpg/v4-460px-Prepare-a-Wall-for-Paint-Step-16.jpg\"]], \"methodsNames\": [\"Clearing the Room and Cleaning the Walls\", \"Filling Cracks and Holes in the Walls\", \"Sanding the Walls\"], \"otherLanguages\": {}, \"quizzes\": [], \"rating\": 100, \"refs\": [\"https://www.diydoctor.org.uk/projects/wall-and-ceiling-preparation-for-painting.htm\", \"https://www.diydoctor.org.uk/projects/wall-and-ceiling-preparation-for-painting.htm\", \"https://www.todayshomeowner.com/video/how-to-prepare-interior-walls-and-trim-for-painting/\", \"https://www.house-painting-info.com/articles/clean-wall-surfaces-before-painting/#.W6GKGVRKjIV\", \"http://www.housepaintingguide.org/masking-indoor-walls/\", \"https://www.realsimple.com/home-organizing/home-improvement/painting/six-steps-painting-room?slide=40710#40710\", \"http://www.housepaintingguide.org/masking-indoor-walls/\", \"https://gopaintsprayer.com/prepare-wall-painting/\", \"https://gopaintsprayer.com/prepare-wall-painting/\"], \"relatedArticles\": [{\"img\": \"https://www.wikihow.com/images/thumb/9/95/Paint-a-Wall-Step-15.jpg/-crop-342-184-245px-Paint-a-Wall-Step-15.jpg\", \"title\": \"How to Paint a Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/8/8d/Choose-an-Accent-Wall-Step-15.jpg/-crop-342-184-245px-Choose-an-Accent-Wall-Step-15.jpg\", \"title\": \"How to Choose an Accent Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fa/Mist-Coat-with-Paint-Step-12.jpg/-crop-342-184-245px-Mist-Coat-with-Paint-Step-12.jpg\", \"title\": \"How to Mist Coat with Paint\"}, {\"img\": null, \"title\": \"How to Paint over Varnish\"}, {\"img\": \"https://www.wikihow.com/images/thumb/4/44/Stain-Brick-Step-16.jpg/-crop-342-184-245px-Stain-Brick-Step-16.jpg\", \"title\": \"How to Stain Brick\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/f0/Skim-Coat-Step-20.jpg/-crop-342-184-245px-Skim-Coat-Step-20.jpg\", \"title\": \"How to Skim Coat\"}, {\"img\": \"https://www.wikihow.com/images/thumb/b/bc/Paint-a-Concrete-Wall-Step-8.jpg/-crop-342-184-295px-Paint-a-Concrete-Wall-Step-8.jpg\", \"title\": \"How to Paint a Concrete Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fb/Paint-Your-Basement-Walls-Step-18.jpg/-crop-342-184-245px-Paint-Your-Basement-Walls-Step-18.jpg\", \"title\": \"How to Paint Your Basement Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/6/65/Paint-Walls-Near-a-Ceiling-Step-20.jpg/-crop-342-184-245px-Paint-Walls-Near-a-Ceiling-Step-20.jpg\", \"title\": \"How to Paint Walls Near a Ceiling\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1b/Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg/-crop-342-184-245px-Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg\", \"title\": \"How to Hide Wall Flaws with Textured Paint\"}, {\"img\": null, \"title\": \"How to Paint an Interior Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/e/ed/Whitewash-Walls-Step-9.jpg/-crop-342-184-245px-Whitewash-Walls-Step-9.jpg\", \"title\": \"How to Whitewash Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/a/a0/Paint-Baseboards-Step-12.jpg/-crop-342-184-245px-Paint-Baseboards-Step-12.jpg\", \"title\": \"How to Paint Baseboards\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1c/Emulsion-Walls-Step-19.jpg/-crop-342-184-245px-Emulsion-Walls-Step-19.jpg\", \"title\": \"How to Emulsion Walls\"}], \"summaryText\": \"Painting a wall is a great way to bring new life to a room when you want to revitalize an old paint job or completely change the look of the room with a bright new color. After choosing the new color for the room, preparation is the most important step to achieving great-looking final results. Prepare your walls properly for paint and the fun and rewarding part of actually painting them will be a breeze!\", \"summaryVideoUrl\": null, \"tipsWarnings\": [], \"tools\": [[\"Assorted Screwdrivers\", \"Plastic Bags\", \"Clean Sponge\", \"Clean Cloths\", \"Dish Detergent\", \"White Vinegar\", \"2-Gallon Bucket\", \"Filling Putty\", \"Putty Knife\", \"Small Paintbrush\", \"Tinted Primer\", \"80-Grit Sandpaper\", \"Sanding Block\", \"Blue Painter's Tape\", \"Plastic, Canvas, or Kraft Paper Drop Sheets\"]], \"topLevelCategories\": [\"Home and Garden\", \"DIY\"], \"updated\": \"August 14, 2019\", \"views\": 3376, \"votes\": 3}, \"_type\": \"_doc\", \"original_rank\": 11, \"reranking_score\": 5.992543697357178}, {\"_id\": \"91221\", \"_index\": \"wikihow-v3\", \"_score\": 9.786696, \"_source\": {\"QAs\": [], \"articleId\": 91221, \"articleTitle\": \"How to Remove Paint from Walls\", \"articleUrl\": \"https://www.wikihow.com/Remove-Paint-from-Walls\", \"author\": {\"blurb\": null, \"n_coauthors\": 16, \"name\": \"wikiHow Staff Editor\"}, \"hasParts\": false, \"hasSummary\": true, \"ingredients\": [], \"methods\": [[\"To prepare the wall for sanding, first fill a bucket with hot water and soap. Then, soak a cloth in the water and wash off the wall. This will remove any dirt or markings that the paint has accumulated, simplifying the rest of the job.\", \"Unfortunately rubbing sandpaper against the wall won't work very well. Instead you will need to invest in a sanding block or a sander. A sanding block is a small block of material that you can wrap sandpaper around, making it easier to sand flat surfaces. A sander is a automated tool like a drill that you load sandpaper into and it sands the surface for you. \\n\\nTo use a sanding block, wrap the sandpaper around one side of the block and grip it with your hand from the other side.\\nSanders can differ in how you load them with the sandpaper, but generally they have a slot that you can load the sandpaper into before turning it on. If you haven't used a sander before, a sanding block is a safer option.\\nA coarser grit on the sandpaper is acceptable because you're aiming to strip the unwanted paint. Use 80-grit sandpaper if you're looking to remove globs of paint.\\nSanding a wall will cause a risk of inhaling toxic dust, so wear a mask before beginning.\", \"Rub the coarse side of the sandpaper against the paint. Move the sanding block or sander back and forth in 1 square foot (0.09 square meter) sections. Apply lots of pressure to the wall if you are using a sanding block.\\nSand the unwanted paint until the entirety of the paint becomes dull. Then, wipe away the dust.\", \"If you prefer to remove the paint entirely as opposed to painting over it, use a paint scraper to peel off the remaining unwanted paint.\\n\\nPlace the paint scraper's blade at the bottom of the unwanted paint, apply pressure to the blade, and slide it under the unwanted paint, peeling the paint off.\\n\\nThe sanding process will have weakened the paint, making it easier to strip.\"], [\"Chemical paint strippers eat away at the chemical structure of paint, so they are naturally caustic. Before beginning this process, make sure you've purchased chemically-resistant gloves to use. Additionally, wear old clothing that you don't mind getting damaged.\\nOpen several windows. Keeping the room you're in well ventilated is key as paint strippers can build up toxic fumes if there's a lack of fresh air.\", \"Chemical paint strippers won't discriminate what they eat through, so make sure the room is clear of all precious items. Move all furniture to a different room while you're removing the paint.\\n\\nTo keep your floor safe you'll need to buy several materials from your nearest DIY store. You will need one large sheet of plastic and another large sheet of either kraft or rosin paper.\\nLay a sheet of plastic from the base of the wall across the floor. Then, layer a sheet of kraft or rosin paper on top of it. If any of the paint stripper lands on the floor, this layer will protect your floor from damage.\", \"Paint stripper is best applied with a wide paintbrush. If you don't have one, make sure you buy one before beginning. Dip the paintbrush into the paint stripper, then layer it over the entirety of the wall. Put on a coating roughly \\u20448 inch (0.32\\u00a0cm) thick so that it won't dry too quickly. The coating thickness doesn't need to be too precise, you can mostly gauge the thickness by eye.\\nIf you're working on a vertical surface, use a paint stripper that is closer to a paste in texture so that it won't drip onto you.\", \"The chemical process may take minutes or hours depending on the stripper you're using. Read the product's instructions and wait as directed for the most efficient use of your time.\", \"The paint on the wall should have started to bubble once you've waited for the directed amount of time. Once bubbling, take a paint scraper (if you don't have one, a putty knife or a spatula would work as well) and scrape off all the paint. It should come off in long peels. Try to get as much paint off the wall as possible.\\n\\nTo use a paint scraper, place the blade at the bottom of the paint you wish to remove, apply pressure so the blade slides under the paint, then peel the paint off as you slide the paint scraper upwards.\\nIf there are any awkward spots, try using toothpicks or toothbrushes you don't plan on using again to scrape off the paint.\\nIf there is an underlying layer of paint that is still solid, you will need to apply another layer of chemical paint stripper to remove that layer separately.\", \"If you plan to repaint the walls, the paint stripper you've just used will cause your new layer of paint to fail. The method used to neutralize a paint stripper is different for each product, but usually, it's either a water wash, a mineral spirit, or a specialized product.\\n\\nFor example, a neutralizer may ask you to mix 1 gallon (3.8\\u00a0L) with 4 fluid ounces (120\\u00a0mL) of neutralizer. Then, use this mixture with a cloth to wash the wall.\\nCheck your stripper instructions and apply however directed.\"], [\"You will be dealing with a high heat appliance, so make sure to use protective eyeglasses and use a thick long-sleeved shirt if you have one, as well as a thick pair of gloves to avoid burns.\\nYou will also need a paint scraper for this method.\", \"A heat gun is best suited for stripping full walls, but if there is a specific spot you wish to strip you'll need to use a heat shield.\\nWith a pair of scissors, cut out a cardboard ring slightly larger than your target area. Then, wrap the cardboard ring in aluminum foil. Place the shield over the spot and continue the process.\", \"In a wide sweeping motion, keeping the nozzle of the heat gun approximately 2 inches (5.1\\u00a0cm) away from the surface, steadily apply heat to square sections of the wall. You can measure these sections using a tape measure.\\n\\nTo start with, heat a 3 feet (0.91\\u00a0m) section on the wall.\\n\\nYou'll know you're ready for the next step when the paint visibly begins to loosen its hold on the surface beneath it.\\nIf you are using a heat shield, focus the nozzle on the single area for a shorter amount of time until you visibly see the paint begin to loosen.\", \"With a paint scraper, scrape away all the loosened paint away from the section you heated earlier. Pierce the loose paint with the blade of the paint scraper, then scrape upwards as if you were shovelling snow to remove the paint.\", \"Choose a new 3 feet (0.91\\u00a0m) section on the wall, heat it up, then scrape the paint off. Keep repeating until you've removed the paint off the entire wall section by section.\"]], \"methodsHeadlines\": [[\"Clean the wall with soap and hot water.\", \"Purchase a sanding block or sander to use.\", \"Sand away the unwanted paint.\", \"Strip the paint if you want to remove it entirely.\"], [\"Buy chemically-resistant gloves and ventilate the room.\", \"Remove all furniture and cover the floor.\", \"Layer the wall with a thorough coating of the paint stripper.\", \"Wait for the stripper to take effect.\", \"Scrape the paint off once you see bubbles.\", \"Follow the paint stripper instructions to neutralize the wall once you're finished.\"], [\"Purchase protective eyeglasses, a long-sleeved shirt and thick gloves.\", \"Craft a heat shield if you only want to strip a specific spot.\", \"Use heat on the unwanted paint.\", \"Scrape away all unwanted paint at the pre-heated section.\", \"Repeat the process over the entire wall.\"]], \"methodsImages\": [[\"https://www.wikihow.com/images/thumb/c/c2/Remove-Paint-from-Walls-Step-1-Version-2.jpg/v4-460px-Remove-Paint-from-Walls-Step-1-Version-2.jpg\", \"https://www.wikihow.com/images/thumb/3/32/Remove-Paint-from-Walls-Step-2-Version-2.jpg/v4-460px-Remove-Paint-from-Walls-Step-2-Version-2.jpg\", \"https://www.wikihow.com/images/thumb/4/40/Remove-Paint-from-Walls-Step-3-Version-2.jpg/v4-460px-Remove-Paint-from-Walls-Step-3-Version-2.jpg\", \"https://www.wikihow.com/images/thumb/4/4e/Remove-Paint-from-Walls-Step-4-Version-2.jpg/v4-460px-Remove-Paint-from-Walls-Step-4-Version-2.jpg\"], [\"https://www.wikihow.com/images/thumb/3/36/Remove-Paint-from-Walls-Step-5-Version-2.jpg/v4-460px-Remove-Paint-from-Walls-Step-5-Version-2.jpg\", \"https://www.wikihow.com/images/thumb/6/6b/Remove-Paint-from-Walls-Step-6.jpg/v4-460px-Remove-Paint-from-Walls-Step-6.jpg\", \"https://www.wikihow.com/images/thumb/0/0c/Remove-Paint-from-Walls-Step-7.jpg/v4-460px-Remove-Paint-from-Walls-Step-7.jpg\", \"https://www.wikihow.com/images/thumb/7/78/Remove-Paint-from-Walls-Step-8.jpg/v4-460px-Remove-Paint-from-Walls-Step-8.jpg\", \"https://www.wikihow.com/images/thumb/5/55/Remove-Paint-from-Walls-Step-9.jpg/v4-460px-Remove-Paint-from-Walls-Step-9.jpg\", \"https://www.wikihow.com/images/thumb/f/f6/Remove-Paint-from-Walls-Step-10.jpg/v4-460px-Remove-Paint-from-Walls-Step-10.jpg\"], [\"https://www.wikihow.com/images/thumb/f/f5/Remove-Paint-from-Walls-Step-11.jpg/v4-460px-Remove-Paint-from-Walls-Step-11.jpg\", \"https://www.wikihow.com/images/thumb/e/ed/Remove-Paint-from-Walls-Step-12.jpg/v4-460px-Remove-Paint-from-Walls-Step-12.jpg\", \"https://www.wikihow.com/images/thumb/2/2e/Remove-Paint-from-Walls-Step-13.jpg/v4-460px-Remove-Paint-from-Walls-Step-13.jpg\", \"https://www.wikihow.com/images/thumb/1/1c/Remove-Paint-from-Walls-Step-14.jpg/v4-460px-Remove-Paint-from-Walls-Step-14.jpg\", \"https://www.wikihow.com/images/thumb/0/00/Remove-Paint-from-Walls-Step-15.jpg/v4-460px-Remove-Paint-from-Walls-Step-15.jpg\"]], \"methodsNames\": [\"Using Sandpaper for Drywall\", \"Trying Chemical Paint Stripper for Plaster Walls\", \"Employing a Heat Gun for Wooden Walls\"], \"otherLanguages\": {\"Espa\\u00f1ol\": {\"title\": \"quitar pintura de las paredes\", \"url\": \"https://es.wikihow.com/quitar-pintura-de-las-paredes\"}, \"Fran\\u00e7ais\": {\"title\": \"enlever la peinture des murs\", \"url\": \"https://fr.wikihow.com/enlever-la-peinture-des-murs\"}, \"Nederlands\": {\"title\": \"Verf van muren verwijderen\", \"url\": \"https://nl.wikihow.com/Verf-van-muren-verwijderen\"}}, \"quizzes\": [], \"rating\": 91, \"refs\": [\"https://www.paintzen.com/advice/how-to-clean-your-walls-before-painting\", \"http://lockuplead.com/lead-poisoning-101/\", \"http://www.repair-home.com/resources/how-to-guides/how-to-strip-paint.html\", \"https://thecraftsmanblog.com/how-to-strip-paint-part-2-scrape-like-a-pro/\", \"https://www.homeimprovementpages.com.au/article/how_to_remove_paint_from_walls\", \"https://www.cpsc.gov/s3fs-public/423%20Paint%20Stripper%20Publication.pdf\", \"https://thecraftsmanblog.com/how-to-strip-paint-part-1-chemical-strippers/\", \"https://thecraftsmanblog.com/how-to-strip-paint-part-1-chemical-strippers/\", \"https://thecraftsmanblog.com/how-to-strip-paint-part-1-chemical-strippers/\"], \"relatedArticles\": [{\"img\": \"https://www.wikihow.com/images/thumb/d/d9/Remove-Paint-from-Wood-Step-21.jpg/-crop-342-184-245px-Remove-Paint-from-Wood-Step-21.jpg\", \"title\": \"How to Remove Paint from Wood\"}, {\"img\": \"https://www.wikihow.com/images/thumb/5/5a/Repair-Peeling-Paint-Step-11.jpg/-crop-342-184-245px-Repair-Peeling-Paint-Step-11.jpg\", \"title\": \"How to Repair Peeling Paint\"}, {\"img\": \"https://www.wikihow.com/images/thumb/a/a6/Remove-Paint-on-Hardwood-Floors-Step-13-Version-2.jpg/-crop-342-184-245px-Remove-Paint-on-Hardwood-Floors-Step-13-Version-2.jpg\", \"title\": \"How to Remove Paint on Hardwood Floors\"}, {\"img\": \"https://www.wikihow.com/images/thumb/4/40/Remove-Paint-from-Vinyl-Step-14-Version-2.jpg/-crop-342-184-245px-Remove-Paint-from-Vinyl-Step-14-Version-2.jpg\", \"title\": \"How to Remove Paint from Vinyl\"}, {\"img\": \"https://www.wikihow.com/images/thumb/d/d6/Remove-Paint-from-an-Acrylic-Tub-or-Bath-Step-11.jpg/-crop-342-184-277px-Remove-Paint-from-an-Acrylic-Tub-or-Bath-Step-11.jpg\", \"title\": \"How to Remove Paint from an Acrylic Tub or Bath\"}, {\"img\": \"https://www.wikihow.com/images/thumb/d/d4/Take-Paint-Off-Brick-Step-3-Version-3.jpg/-crop-342-184-245px-Take-Paint-Off-Brick-Step-3-Version-3.jpg\", \"title\": \"How to Take Paint Off Brick\"}, {\"img\": \"https://www.wikihow.com/images/thumb/0/0f/Remove-Paint-from-Iron-Railings-Step-14.jpg/-crop-342-184-245px-Remove-Paint-from-Iron-Railings-Step-14.jpg\", \"title\": \"How to Remove Paint from Iron Railings\"}, {\"img\": \"https://www.wikihow.com/images/thumb/6/67/Remove-Epoxy-Paint-Step-23.jpg/-crop-342-184-245px-Remove-Epoxy-Paint-Step-23.jpg\", \"title\": \"How to Remove Epoxy Paint\"}, {\"img\": \"https://www.wikihow.com/images/thumb/4/45/Remove-Primer-Step-21.jpg/-crop-342-184-245px-Remove-Primer-Step-21.jpg\", \"title\": \"How to Remove Primer\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fe/Strip-Latex-Paint-from-Wood-Step-12.jpg/-crop-342-184-245px-Strip-Latex-Paint-from-Wood-Step-12.jpg\", \"title\": \"How to Strip Latex Paint from Wood\"}, {\"img\": \"https://www.wikihow.com/images/thumb/7/71/Remove-Paint-from-a-Concrete-Porch-Step-10.jpg/-crop-342-184-276px-Remove-Paint-from-a-Concrete-Porch-Step-10.jpg\", \"title\": \"How to Remove Paint from a Concrete Porch\"}, {\"img\": \"https://www.wikihow.com/images/thumb/8/81/Remove-Paint-from-Light-Fixtures-Step-13.jpg/-crop-342-184-245px-Remove-Paint-from-Light-Fixtures-Step-13.jpg\", \"title\": \"How to Remove Paint from Light Fixtures\"}, {\"img\": \"https://www.wikihow.com/images/thumb/b/b9/Remove-Lead-Paint-Step-20-Version-2.jpg/-crop-342-184-245px-Remove-Lead-Paint-Step-20-Version-2.jpg\", \"title\": \"How to Remove Lead Paint\"}, {\"img\": \"https://www.wikihow.com/images/thumb/b/bd/Strip-Paint-Step-12-Version-3.jpg/-crop-342-184-245px-Strip-Paint-Step-12-Version-3.jpg\", \"title\": \"How to Strip Paint\"}], \"summaryText\": \"When it comes to home improvement projects, it's great to know that with the right equipment and methods, no paint job is permanent, and removal is often an easy process! Whether you have come to regret a color choice or make a mistake, paint can be stripped off using specialized equipment like a paint scraper, sandpaper, or a heat gun. The method that you use will be based on your budget, the type of wall and paint, and your confidence in handling the tools. Once you have this figured out and you acquire your tools, you'll be well on your way to getting that paint off of your wall so you can make it look better than ever!\", \"summaryVideoUrl\": null, \"tipsWarnings\": [], \"tools\": [[\"A cloth\", \"A bucket\", \"Soap\", \"180-grit sandpaper or 80-grit sandpaper\", \"A sander or sanding block\", \"A dust mask\", \"A paint scraper\"], [\"Chemically-resistant gloves\", \"Plastic sheet\", \"Rosin paper or kraft paper\", \"Chemical paint stripper\", \"A paint scraper\"], [\"Heat gun\", \"A paint scraper\"]], \"topLevelCategories\": [\"Home and Garden\", \"DIY\"], \"updated\": \"November 4, 2019\", \"views\": 57162, \"votes\": 11}, \"_type\": \"_doc\", \"original_rank\": 24, \"reranking_score\": 5.6678009033203125}, {\"_id\": \"92470\", \"_index\": \"wikihow-v3\", \"_score\": 10.112697, \"_source\": {\"QAs\": [[\"I primed the wall, then textured using knock down texture. Do I have to prime over this before I paint?\", \"Yes. If you have unprimed new texture on your walls, you need to prime them first so the paint doesn't seep into the texture. It is recommended that all new walls be primed before painting. Primer acts as a 'sealer' of sorts to new walls. Even if the paint says \\\"one coat coverage,\\\" professional painters know a minimum of two coats are needed.\"], [\"My tenant threw spackle on walls in sharp points in two bedrooms. How can I fix it to make it presentable?\", \"You can knock off the sharp points with a trowel -- or, if they're not too big, you can sand them off. After they're removed, you'll have to prime the spots and then repaint. \"], [\"What is the difference between acrylic and alkaloid paint?\", \"The main difference is that acrylic paint is water-based while alkaloid paint is solvent-based. \"]], \"articleId\": 92470, \"articleTitle\": \"How to Paint Textured Walls\", \"articleUrl\": \"https://www.wikihow.com/Paint-Textured-Walls\", \"author\": {\"blurb\": null, \"n_coauthors\": 6, \"name\": null}, \"hasParts\": false, \"hasSummary\": true, \"ingredients\": [], \"methods\": [[\"Cover the floors and furniture, fill any small holes, remove outlet covers, tape off the trim and cut in the corners with a brush.\", \"This type won't be as readily absorbed by the texture as latex. Alkyd paint is also easier to clean, which is important on textured walls because they attract more dirt. Don't paint a textured wall white.\", \"A test is necessary to confirm the water-fastness of the texture. If the texture starts to soften and fall off, you will have to use an airless paint sprayer to paint the walls. If the texture holds up, you can use a brush or roller.\"], [\"\", \"This will help ensure that paint covers every part of the textured wall. It also hides the brush strokes.\"], [\"If this fails to adequately cover the texture, switch to one with a 1 1/4-inch (3 cm) nap.\", \"This will leave drips of paint on the walls.\", \"If this doesn't do an adequate job, roll the paint on in a \\\"V\\\" pattern, then follow up with vertical strokes.\\nBecause of the amount of paint that the roller will hold and the increased possibility of splatter, use the roller more slowly than if you were painting a smooth wall.\", \"Remove the excess with a dry roller.\"], [\"Overlap the each previous section by about 50 percent.\", \"Going too fast won't cover everything, and going too slow will cause drips.\"]], \"methodsHeadlines\": [[\"Prepare the room for painting as you normally would.\", \"Choose a semi-gloss alkyd paint.\", \"Test a alkyd primer on a small portion of the wall.\"], [\"Choose a wide, soft brush, called a wall brush.\", \"Paint diagonally first in one direction, then the other.\"], [\"Choose a good 9-inch (23 cm) lamb shearling roller cover with a 3/4-inch (2 cm) nap.\", \"Fully load the roller with paint.\", \"Cover the wall in overlapping vertical strokes.\", \"Check for areas that have too much paint on them.\"], [\"Paint in 4-foot (1.2 meter) horizontal strokes.\", \"Practice on a piece of scrap wood to learn how fast to lay down the paint.\"]], \"methodsImages\": [[\"https://www.wikihow.com/images/thumb/9/94/Paint-Textured-Walls-Step-1.jpg/v4-460px-Paint-Textured-Walls-Step-1.jpg\", \"https://www.wikihow.com/images/thumb/2/24/Paint-Textured-Walls-Step-2.jpg/v4-460px-Paint-Textured-Walls-Step-2.jpg\", \"https://www.wikihow.com/images/thumb/3/3b/Paint-Textured-Walls-Step-3.jpg/v4-460px-Paint-Textured-Walls-Step-3.jpg\"], [\"https://www.wikihow.com/images/thumb/c/c5/Paint-Textured-Walls-Step-4.jpg/v4-460px-Paint-Textured-Walls-Step-4.jpg\", \"https://www.wikihow.com/images/thumb/c/c2/Paint-Textured-Walls-Step-5.jpg/v4-460px-Paint-Textured-Walls-Step-5.jpg\"], [\"https://www.wikihow.com/images/thumb/9/9b/Paint-Textured-Walls-Step-6.jpg/v4-460px-Paint-Textured-Walls-Step-6.jpg\", \"https://www.wikihow.com/images/thumb/1/1c/Paint-Textured-Walls-Step-7-Version-2.jpg/v4-460px-Paint-Textured-Walls-Step-7-Version-2.jpg\", \"https://www.wikihow.com/images/thumb/3/35/Paint-Textured-Walls-Step-7.jpg/v4-460px-Paint-Textured-Walls-Step-7.jpg\", \"https://www.wikihow.com/images/thumb/f/f3/Paint-Textured-Walls-Step-8.jpg/v4-460px-Paint-Textured-Walls-Step-8.jpg\"], [\"https://www.wikihow.com/images/thumb/6/60/Paint-Textured-Walls-Step-9.jpg/v4-460px-Paint-Textured-Walls-Step-9.jpg\", \"https://www.wikihow.com/images/thumb/e/e6/Paint-Textured-Walls-Step-10.jpg/v4-460px-Paint-Textured-Walls-Step-10.jpg\"]], \"methodsNames\": [\"Preparing to Paint\", \"Painting with a Brush\", \"Painting with a Roller\", \"Painting with an Airless Sprayer\"], \"otherLanguages\": {\"Espa\\u00f1ol\": {\"title\": \"pintar paredes texturizadas\", \"url\": \"https://es.wikihow.com/pintar-paredes-texturizadas\"}, \"Fran\\u00e7ais\": {\"title\": \"peindre un mur structur\\u00e9\", \"url\": \"https://fr.wikihow.com/peindre-un-mur-structur%C3%A9\"}, \"Italiano\": {\"title\": \"Dipingere Pareti Ruvide\", \"url\": \"https://www.wikihow.it/Dipingere-Pareti-Ruvide\"}, \"Portugu\\u00eas\": {\"title\": \"Pintar Paredes Texturizadas\", \"url\": \"https://pt.wikihow.com/Pintar-Paredes-Texturizadas\"}, \"\\u0420\\u0443\\u0441\\u0441\\u043a\\u0438\\u0439\": {\"title\": \"\\u043f\\u043e\\u043a\\u0440\\u0430\\u0441\\u0438\\u0442\\u044c \\u0440\\u0435\\u043b\\u044c\\u0435\\u0444\\u043d\\u044b\\u0435 \\u0441\\u0442\\u0435\\u043d\\u044b\", \"url\": \"https://ru.wikihow.com/%D0%BF%D0%BE%D0%BA%D1%80%D0%B0%D1%81%D0%B8%D1%82%D1%8C-%D1%80%D0%B5%D0%BB%D1%8C%D0%B5%D1%84%D0%BD%D1%8B%D0%B5-%D1%81%D1%82%D0%B5%D0%BD%D1%8B\"}}, \"quizzes\": [], \"rating\": 94, \"refs\": [\"http://www.housepainting-guru.com/painting-textured-walls.html\", \"https://www.bhg.com/decorating/paint/room/how-to-prep-a-room-for-paint-281474979610966/\", \"https://www.countryliving.com/home-design/color/g1297/paint-finishes/?slide=12\", \"https://lifehacker.com/how-to-choose-the-right-paint-brush-for-your-next-diy-p-1717963975\", \"https://www.youtube.com/watch?v=vGxmPNPKj5M\", \"https://www.thisoldhouse.com/how-to/how-to-choose-roller\", \"https://www.thisoldhouse.com/how-to/how-to-roll-paint-wall\", \"https://www.youtube.com/watch?v=hswJQ3JJvKs\", \"https://www.youtube.com/watch?v=tzFdS79qVt4\"], \"relatedArticles\": [{\"img\": null, \"title\": \"How to Load a Paint Roller\"}, {\"img\": \"https://www.wikihow.com/images/thumb/9/95/Paint-a-Wall-Step-15.jpg/-crop-342-184-245px-Paint-a-Wall-Step-15.jpg\", \"title\": \"How to Paint a Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/8/8d/Choose-an-Accent-Wall-Step-15.jpg/-crop-342-184-245px-Choose-an-Accent-Wall-Step-15.jpg\", \"title\": \"How to Choose an Accent Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fa/Mist-Coat-with-Paint-Step-12.jpg/-crop-342-184-245px-Mist-Coat-with-Paint-Step-12.jpg\", \"title\": \"How to Mist Coat with Paint\"}, {\"img\": null, \"title\": \"How to Paint over Varnish\"}, {\"img\": \"https://www.wikihow.com/images/thumb/4/44/Stain-Brick-Step-16.jpg/-crop-342-184-245px-Stain-Brick-Step-16.jpg\", \"title\": \"How to Stain Brick\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/f0/Skim-Coat-Step-20.jpg/-crop-342-184-245px-Skim-Coat-Step-20.jpg\", \"title\": \"How to Skim Coat\"}, {\"img\": \"https://www.wikihow.com/images/thumb/b/bc/Paint-a-Concrete-Wall-Step-8.jpg/-crop-342-184-295px-Paint-a-Concrete-Wall-Step-8.jpg\", \"title\": \"How to Paint a Concrete Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fb/Paint-Your-Basement-Walls-Step-18.jpg/-crop-342-184-245px-Paint-Your-Basement-Walls-Step-18.jpg\", \"title\": \"How to Paint Your Basement Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/6/65/Paint-Walls-Near-a-Ceiling-Step-20.jpg/-crop-342-184-245px-Paint-Walls-Near-a-Ceiling-Step-20.jpg\", \"title\": \"How to Paint Walls Near a Ceiling\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1b/Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg/-crop-342-184-245px-Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg\", \"title\": \"How to Hide Wall Flaws with Textured Paint\"}, {\"img\": null, \"title\": \"How to Paint an Interior Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/e/ed/Whitewash-Walls-Step-9.jpg/-crop-342-184-245px-Whitewash-Walls-Step-9.jpg\", \"title\": \"How to Whitewash Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/a/a0/Paint-Baseboards-Step-12.jpg/-crop-342-184-245px-Paint-Baseboards-Step-12.jpg\", \"title\": \"How to Paint Baseboards\"}], \"summaryText\": \"Painting textured walls can be a challenge. Instead of a plain, vertical surface, there are a multitude of angled surfaces, both large and small, that normal paint brushes and rollers will skip over. To completely cover a textured wall, you need to use the right equipment and a different painting technique.\", \"summaryVideoUrl\": null, \"tipsWarnings\": [\"Remember the rule: oil over water, but never water over oil. If you choose to cover oil-based paint with water-based paint, you must prime first.\"], \"tools\": [[\"Alkyd primer\", \"Alkyd paint\", \"Paint brushes or rollers\", \"Extension handle\", \"Paint cans or trays with screen\", \"Airless paint sprayer\", \"Drop cloths\", \"Painters tape\", \"Solvent\", \"Putty\", \"Putty knife\"]], \"topLevelCategories\": [\"Home and Garden\", \"DIY\"], \"updated\": \"November 5, 2019\", \"views\": 130977, \"votes\": 16}, \"_type\": \"_doc\", \"original_rank\": 20, \"reranking_score\": 5.161352157592773}, {\"_id\": \"92461\", \"_index\": \"wikihow-v3\", \"_score\": 9.941605, \"_source\": {\"QAs\": [[\"How do I cover my walls to paint ceilings?\", \"The easiest way to do this would be to put painter's tape in the area where the wall meets the ceiling. For additional protection, you could also hang a tarp over the wall with painter's tape.\"], [\"Do you need to remove the tape after the first coat and reapply for the second?\", \"It's easier to place the tape on the ceiling. Then you won't have to move it all! You can apply both coats and then take down the tape when you're done.\"], [\"What if I cannot reach the ceiling in order to put tape up? What else can I use?\", \"Use a ladder to reach, or there are ceiling edge attachments you can get that have wheels that roll along the ceiling and puts paint on the wall. Or you could call a professional painter who already has the right tools and equipment.\"], [\"Do I need to \\\"cut in\\\" for my second coat of paint?\", \"Sometimes when there is a color change it takes two coats of paint to achieve the proper color depth. I would cut in and roll the first coat and see if the color is right in the cut in areas. If not, a second cut in coat can be done to make it all uniform in color. There are times when two cut in coats are darker than the 1 rolled coat, and then a second rolled coat may be needed as well.  \"], [\"If I have a popcorn ceiling, what do I use to paint the wall and ceiling?\", \"A very carefully used paint brush where they meet and, about four inches away from that, seam on both surfaces, known as \\\"cutting-in.\\\" Then, a regular roller application of paint can be used up to that shared corner or seam.\"], [\"How can I cover the walls if I want to paint the ceiling?\", \"If you want to take precautions and feel that you will get it onto the walls, take plastic rolls and drape them down the walls, securing to the highest point of the wall with painters tape. If you are painting the walls as well, no need to cover anything; just paint away, and when you reach the walls, go down the wall about halfway with ceiling paint to give yourself a clean cut in line.\"]], \"articleId\": 92461, \"articleTitle\": \"How to Paint Walls Near a Ceiling\", \"articleUrl\": \"https://www.wikihow.com/Paint-Walls-Near-a-Ceiling\", \"author\": {\"blurb\": null, \"n_coauthors\": 11, \"name\": \"wikiHow Staff Editor\"}, \"hasParts\": true, \"hasSummary\": true, \"ingredients\": [], \"methods\": [[\"Anything hanging on the walls has to go, including artwork and mirrors. Take down curtains and other decorations that could get in your way. Consider also moving furniture out of the room so it isn\\u2019t in your way while you\\u2019re painting. At the very least, slide it away from where you\\u2019re painting so nothing drips on it.\\nNote anything near or on the ground. Even though it might not be in your way now, it could be when you start painting the rest of each wall.\", \"Shut off the room\\u2019s electricity using your home\\u2019s circuit breaker or fuse box. Once you\\u2019re sure the electrical components are safe to touch, start taking them off the wall. This includes light fixtures, outlet covers, and switches. Some of them require a screwdriver to remove.\\n\\nIf you are unable to remove something, like an outlet cover, you can place painter\\u2019s tape around it to protect it.\\nThe circuit breaker or fuse box is usually on the lowest level of your home. Look for a labeled switch controlling power to the room you want to paint.\", \"Although you won\\u2019t be working with a lot of paint all at once, the risk of drips still remains. Protect your floor by keeping it covered. Spread the tarp or drop cloth flat, then try taping it to the lower part of the wall or floor to prevent it from moving.\\nProtective covers are available online and at most hardware stores along with all the other supplies you may need to paint the walls.\", \"For walls that have stubborn stains, try using a grease-cutting liquid dish detergent. Mix about 1 teaspoon (4.9\\u00a0mL) of the detergent into 4 cups (950\\u00a0mL) of warm water. Scrub the wall with the mixture to eliminate any noticeable stains.\\n\\nAny debris on the wall could prevent the paint from adhering properly. This can be a big issue in rooms that get a lot of use, such as your kitchen.\\nFor extra power, try adding \\u20444 teaspoon (1.2\\u00a0mL) of white vinegar to the mixture and letting it soak into stubborn stains for 10 minutes.\", \"To prepare the wall for painting, eliminate any moisture left on the walls while also checking for remaining debris. Make sure the wall is dry to the touch. Moisture could cause the paint to bubble and crack later.\\n\\nIf you used soap, wipe the wall clean with a damp cloth before drying it.\\nYou can let the walls air dry and this is usually the easier thing to do while you\\u2019re preparing your painting supplies. It can take 10 to 30 minutes, so make sure the walls finish drying.\"], [\"Painter\\u2019s tape doesn\\u2019t leave any adhesive behind, so it\\u2019s the best choice for protecting the ceiling. Position it along the edge of the ceiling where it meets the wall. Make sure the tape is on the ceiling, not the wall. As you spread the tape out, press down on it to ensure it\\u2019s flat against the ceiling.\\n\\nTry applying the tape in strips about 2 to 3\\u00a0ft (0.61 to 0.91\\u00a0m) long. Anything longer than that can be too difficult to work with.\\nAny pockets of air underneath the tape could provide space for paint to seep into. Make sure the tape is as smooth and flat as you can make it!\", \"Protect yourself against paint fumes. If you don\\u2019t have any ventilation fans in the room, leave the windows and doors open. Also, keep other people out of the area until you\\u2019re finished.\\nYou don\\u2019t really need gloves or any other gear while painting, although they can be useful for avoiding messes.\", \"Using a standard painter\\u2019s tray will make the task more difficult since they tend to be bulky and difficult to maneuver up a latter. You could use a plastic bucket with a handle instead if you don\\u2019t have a suitable bowl. Fill it with primer that is compatible with the type of paint you plan on using.\\n\\nMost indoor paints are water-based latex. There are also some oil-based paints, so make sure you get a compatible primer if you\\u2019re using one.\\n\\nIf you are able to reach the ceiling without climbing very high, you could still put the paint in a tray or leave it in the canister.\", \"Start with an angled brush about 2 to 4\\u00a0in (5.1 to 10.2\\u00a0cm) long. Dip it into the primer so the bottom \\u20442 to 1\\u00a0in (1.3 to 2.5\\u00a0cm) of the bristles are coated. The shape of the angled brush allows you to maneuver across the wall without getting paint on the ceiling. However, be careful to avoid adding too much primer to the wall at once.\\n\\nShake out the brush before using it. Tap it on the sides of the bowl. If it looks like it\\u2019s dripping or overloaded, brush some of the paint off on the bowl to prevent splattering.\\nYou could also try using a small roller. If you\\u2019re careful, it can be an effective tool that lets you work at a faster rate.\"], [\"Set up a stepladder in one corner if you need help reaching the ceiling. Then, position the brush so the bristles are arranged horizontally on the wall with the handle pointing out toward you. Press it down gently so the primer-covered bristles are flat against the wall but not touching the ceiling. The tips of the bristles should just barely touch the painter\\u2019s tape.\\nTake your time to make sure the primer spreads across the wall consistently without splashing onto the ceiling.\", \"This process is called \\u201ccutting in\\u201d and even professionals use it to apply primer to tight areas. Hold the brush still as you drag the bristles from one corner to the other. Reload the brush with more paint as it dries out. Also, go back over the surface to fill in any gaps and even out the paint.\\n\\nGo back over areas that look uneven. You can always reverse direction with the brush. It won\\u2019t affect the finish.\\nNote that the primer dries out relatively quickly. To avoid trouble, prime and paint the walls one at a time.\", \"The additional space will give you a little breathing space later on when you\\u2019re finishing the walls. Continue reloading the brush and dragging it across the walls. You can switch to a wider brush if you prefer and hold it with the bristles aligned vertically.\\nFilling in this additional bit of space means you don\\u2019t have to get too close to the ceiling later. It\\u2019s helpful for using bigger tools, like rollers, that aren\\u2019t quite as accurate as small brushes.\", \"The other corners are also hard to reach and should be primed with a small, angled brush. Apply the primer along the corners where the walls meet. When you reach the bottom of the wall, turn the brush again so the bristles are parallel to the floor or baseboard. Work across this area to fill it in with a 2\\u00a0in (5.1\\u00a0cm) strip of color.\\nRemember to place painter\\u2019s tape over any areas you don\\u2019t wish to paint, such as baseboards. If you\\u2019re planning on painting all of the walls the same color, you won\\u2019t need to separate them with tape.\", \"The easiest way to finish priming the walls is with a big paint roller on an extension handle. Coat the roller in a consistent amount of primer, making sure it doesn\\u2019t drip, then start at the initial 2\\u00a0in (5.1\\u00a0cm) stripe you made near the ceiling. Drag the roller from the top of the wall to the bottom to finish coating it in a consistent layer of primer.\\nBe careful to avoid dragging the roller all the way to the ceiling. Stop at the stripe so you don\\u2019t inadvertently end up with paint where you don\\u2019t want it.\", \"Check the manufacturer\\u2019s recommendations for a more specific estimate of the time required for the primer to dry. Make sure it is at least dry to the touch before painting over it.\\nNote that humid or cold weather make both paint and primer dry at a slower rate.\"], [\"Most people choose a latex paint since it is water-resistant and easy to clean. This kind of paint is usually ready for use straight out of the canister. To fill in the space near the ceiling, start with a little bit of paint in a small bowl or a bucket that is easy to haul up a ladder.\\n\\nWater-based paints like latex paint tend to dry quickly. When you\\u2019re not using the paint, keep the canister closed. Cover paint bowls and trays with a damp rag.\\nOil-based paints don\\u2019t require special preparation either as long as the walls are clean and well-coated in primer.\", \"Pour some paint into another small bowl, then apply the paint through the same \\u201ccutting in\\u201d process you used for the primer. Start with the space between the ceiling and the walls first. Move down the corners between the walls, then finish up with the area near the floor.\\nRemember to create a 2\\u00a0in (5.1\\u00a0cm) stripe around each edge so you don\\u2019t have any trouble operating the roller.\", \"Coat a roller in the paint you plan on using, then paint each wall from top to bottom. Work on the walls one at a time. Make sure you don\\u2019t paint past the initial 2\\u00a0in (5.1\\u00a0cm) stripes you made around the edges, or else the paint could end up on the ceiling.\\nIf an area looks uneven, roll over it again at a steady pace. The initial layer doesn\\u2019t have to be perfect, but it should look pretty consistent.\", \"The drying time will vary depending on the product you\\u2019re using. House paints, particularly the latex-based ones most often used on walls, dry out at a reasonable rate. After the paint dries, you can check the finish and apply a second coat as needed to make it more consistent.\\n\\nMost paint jobs require a second coat of paint. You don\\u2019t have to redo the edges around the ceiling again. However, give this second coating time to dry out, too.\\nOil-paints dry out at a much slower rate. They usually take as long as 24 hours to finish, so note the manufacturer\\u2019s recommendations.\", \"Pick at the edge of the tape in one corner. You should be able to lift it by hand. After that, it peels right off without leaving any stains on the wall. Continue peeling off all the tape to admire the new finish.\\n\\nRemoving the tape too early could smear the paint, ruining your attempts to keep it off the ceiling.\\nPainter\\u2019s tape doesn\\u2019t leave adhesive behind, but you can always scrub away any lingering stains or stickiness with a little bit of water. Make sure that the paint is dry and waterproof before doing this.\"]], \"methodsHeadlines\": [[\"Remove everything in the room that will get in your way.\", \"Turn off the power before removing electrical fixtures.\", \"Cover the floor with a plastic tarp or drop cloth.\", \"Wipe the walls clean with warm water and a sponge.\", \"Dry the walls with a clean cloth before painting it.\"], [\"Cover the ceiling near the wall with painter's tape.\", \"Put on a dust mask and open nearby windows.\", \"Pour 1 to 2 cups (240 to 470 mL) of primer into a small bowl.\", \"Dip a small, angled brush into the primer.\"], [\"Press the paintbrush against the wall in one corner.\", \"Drag the brush around the edges of the room to prime it.\", \"Prime down to 2 in (5.1 cm) from the top of the wall.\", \"Use the brush to prime the other corners in the room.\", \"Finish the rest of the room using a roller.\", \"Wait up to 3 hours for the primer to dry.\"], [\"Fill a small bowl with the paint you plan on using.\", \"Paint around the edges of the wall with an angled brush.\", \"Use a roller to finish painting the rest of each wall.\", \"Wait about 4 hours for the paint to dry.\", \"Peel off the painter\\u2019s tape once the walls have finished drying.\"]], \"methodsImages\": [[\"https://www.wikihow.com/images/thumb/6/64/Paint-Walls-Near-a-Ceiling-Step-1-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-1-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/3/3c/Paint-Walls-Near-a-Ceiling-Step-2-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-2-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/f/fe/Paint-Walls-Near-a-Ceiling-Step-3-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-3-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/a/a1/Paint-Walls-Near-a-Ceiling-Step-4-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-4-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/5/5d/Paint-Walls-Near-a-Ceiling-Step-5-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-5-Version-3.jpg\"], [\"https://www.wikihow.com/images/thumb/5/5b/Paint-Walls-Near-a-Ceiling-Step-6-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-6-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/6/6c/Paint-Walls-Near-a-Ceiling-Step-7-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-7-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/e/e5/Paint-Walls-Near-a-Ceiling-Step-8-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-8-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/0/0c/Paint-Walls-Near-a-Ceiling-Step-9-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-9-Version-3.jpg\"], [\"https://www.wikihow.com/images/thumb/8/83/Paint-Walls-Near-a-Ceiling-Step-10-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-10-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/3/3a/Paint-Walls-Near-a-Ceiling-Step-11-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-11-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/3/3e/Paint-Walls-Near-a-Ceiling-Step-12-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-12-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/2/22/Paint-Walls-Near-a-Ceiling-Step-13-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-13-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/e/e9/Paint-Walls-Near-a-Ceiling-Step-14-Version-3.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-14-Version-3.jpg\", \"https://www.wikihow.com/images/thumb/7/7c/Paint-Walls-Near-a-Ceiling-Step-15.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-15.jpg\"], [\"https://www.wikihow.com/images/thumb/f/f3/Paint-Walls-Near-a-Ceiling-Step-16.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-16.jpg\", \"https://www.wikihow.com/images/thumb/f/fe/Paint-Walls-Near-a-Ceiling-Step-17.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-17.jpg\", \"https://www.wikihow.com/images/thumb/1/1c/Paint-Walls-Near-a-Ceiling-Step-18.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-18.jpg\", \"https://www.wikihow.com/images/thumb/6/6d/Paint-Walls-Near-a-Ceiling-Step-19.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-19.jpg\", \"https://www.wikihow.com/images/thumb/6/65/Paint-Walls-Near-a-Ceiling-Step-20.jpg/v4-460px-Paint-Walls-Near-a-Ceiling-Step-20.jpg\"]], \"methodsNames\": [\"Safeguarding the Room\", \"Taping Walls and Pouring Primer\", \"Priming the Walls\", \"Applying Paint\"], \"otherLanguages\": {\"Deutsch\": {\"title\": \"Streichen zwischen Wand und Decke\", \"url\": \"https://de.wikihow.com/Streichen-zwischen-Wand-und-Decke\"}, \"Espa\\u00f1ol\": {\"title\": \"pintar una pared cerca del cielo raso\", \"url\": \"https://es.wikihow.com/pintar-una-pared-cerca-del-cielo-raso\"}, \"Fran\\u00e7ais\": {\"title\": \"peindre des murs pr\\u00e8s d'un plafond\", \"url\": \"https://fr.wikihow.com/peindre-des-murs-pr%C3%A8s-d%27un-plafond\"}, \"Italiano\": {\"title\": \"Pitturare le Pareti Vicino al Soffitto\", \"url\": \"https://www.wikihow.it/Pitturare-le-Pareti-Vicino-al-Soffitto\"}, \"Portugu\\u00eas\": {\"title\": \"Pintar as Paredes Perto do Teto\", \"url\": \"https://pt.wikihow.com/Pintar-as-Paredes-Perto-do-Teto\"}, \"\\u0420\\u0443\\u0441\\u0441\\u043a\\u0438\\u0439\": {\"title\": \"\\u043f\\u043e\\u043a\\u0440\\u0430\\u0441\\u0438\\u0442\\u044c \\u0441\\u0442\\u0435\\u043d\\u044b \\u0443 \\u043f\\u043e\\u0442\\u043e\\u043b\\u043a\\u0430\", \"url\": \"https://ru.wikihow.com/%D0%BF%D0%BE%D0%BA%D1%80%D0%B0%D1%81%D0%B8%D1%82%D1%8C-%D1%81%D1%82%D0%B5%D0%BD%D1%8B-%D1%83-%D0%BF%D0%BE%D1%82%D0%BE%D0%BB%D0%BA%D0%B0\"}}, \"quizzes\": [], \"rating\": -1, \"refs\": [\"https://www.popularmechanics.com/home/interior-projects/how-to/g151/13-painting-secrets-the-pros-wont-tell-you/\", \"https://www.bobvila.com/articles/388-how-to-paint-a-room/\", \"https://www.popularmechanics.com/home/interior-projects/how-to/g151/13-painting-secrets-the-pros-wont-tell-you/\", \"https://www.bobvila.com/articles/388-how-to-paint-a-room/\", \"https://www.bobvila.com/articles/388-how-to-paint-a-room/\", \"https://www.thisoldhouse.com/how-to/how-to-paint-room\", \"https://www.poison.org/articles/2013-dec/paints-for-indoor-use\", \"https://www.youtube.com/watch?v=5zI7sgL3Rwk&feature=youtu.be&t=93\", \"https://www.thisoldhouse.com/how-to/how-to-paint-room\"], \"relatedArticles\": [{\"img\": \"https://www.wikihow.com/images/thumb/f/f1/Paint-Masonry-Walls-Step-5.jpg/-crop-342-184-245px-Paint-Masonry-Walls-Step-5.jpg\", \"title\": \"How to Paint Masonry Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/8/8d/Paint-Walls-With-Stencils-Step-16.jpg/-crop-342-184-242px-Paint-Walls-With-Stencils-Step-16.jpg\", \"title\": \"How to Paint Walls With Stencils\"}, {\"img\": null, \"title\": \"How to Paint an Interior Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/c/c4/Paint-Exterior-Walls-With-a-Paint-Sprayer-Step-11.jpg/-crop-342-184-245px-Paint-Exterior-Walls-With-a-Paint-Sprayer-Step-11.jpg\", \"title\": \"How to Paint Exterior Walls With a Paint Sprayer\"}, {\"img\": \"https://www.wikihow.com/images/thumb/9/95/Paint-a-Wall-Step-15.jpg/-crop-342-184-245px-Paint-a-Wall-Step-15.jpg\", \"title\": \"How to Paint a Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/8/8d/Choose-an-Accent-Wall-Step-15.jpg/-crop-342-184-245px-Choose-an-Accent-Wall-Step-15.jpg\", \"title\": \"How to Choose an Accent Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fa/Mist-Coat-with-Paint-Step-12.jpg/-crop-342-184-245px-Mist-Coat-with-Paint-Step-12.jpg\", \"title\": \"How to Mist Coat with Paint\"}, {\"img\": null, \"title\": \"How to Paint over Varnish\"}, {\"img\": \"https://www.wikihow.com/images/thumb/4/44/Stain-Brick-Step-16.jpg/-crop-342-184-245px-Stain-Brick-Step-16.jpg\", \"title\": \"How to Stain Brick\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/f0/Skim-Coat-Step-20.jpg/-crop-342-184-245px-Skim-Coat-Step-20.jpg\", \"title\": \"How to Skim Coat\"}, {\"img\": \"https://www.wikihow.com/images/thumb/b/bc/Paint-a-Concrete-Wall-Step-8.jpg/-crop-342-184-295px-Paint-a-Concrete-Wall-Step-8.jpg\", \"title\": \"How to Paint a Concrete Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fb/Paint-Your-Basement-Walls-Step-18.jpg/-crop-342-184-245px-Paint-Your-Basement-Walls-Step-18.jpg\", \"title\": \"How to Paint Your Basement Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1b/Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg/-crop-342-184-245px-Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg\", \"title\": \"How to Hide Wall Flaws with Textured Paint\"}, {\"img\": \"https://www.wikihow.com/images/thumb/e/ed/Whitewash-Walls-Step-9.jpg/-crop-342-184-245px-Whitewash-Walls-Step-9.jpg\", \"title\": \"How to Whitewash Walls\"}], \"summaryText\": \"The space where a wall meets the ceiling is tight and difficult to reach with a traditional paintbrush. Keeping paint off the ceiling can seem like an impossibility, but it is actually simple because of one basic painting technique. Before you begin painting, be sure to wash the walls and apply painter\\u2019s tape to protect the ceiling. Then, use an angled brush to begin coating the area right below the tape. If you do this before attempting to paint the rest of the wall space, you can complete the room with a spotless finish.\", \"summaryVideoUrl\": null, \"tipsWarnings\": [\"Always paint the ceiling before attempting to paint the walls. Wait for the paint to dry before placing painter\\u2019s tape on it.\", \"Rooms are meant to be painted from top to bottom. If you\\u2019re planning on painting the ceiling, do it before working on the walls.\", \"If you end up getting paint on the ceiling, you could apply a 1\\u20444\\u00a0in (0.64\\u00a0cm) layer of caulk around its perimeter to hide the paint. Most caulk can be sanded flat and painted over so it blends in.\", \"Treat floors and other edges the same way you treat the ceiling. Since these areas are tight and can look sloppy if you use the wrong tools, use the \\u201ccutting in\\u201d technique for them.\"], \"tools\": [[\"Painter's tape\", \"Angled painter's brush\", \"Paint\", \"Small bowl\", \"Paint roller with extension\", \"Paint roller tray\", \"Water\", \"Scrubbing rag\", \"Ladder or stepping stool\", \"Dust mask\", \"Grease-cutting liquid dish detergent (optional)\", \"Mixing bucket (optional)\"]], \"topLevelCategories\": [\"Home and Garden\", \"DIY\"], \"updated\": \"December 22, 2019\", \"views\": 172706, \"votes\": null}, \"_type\": \"_doc\", \"original_rank\": 22, \"reranking_score\": 5.061254978179932}, {\"_id\": \"92474\", \"_index\": \"wikihow-v3\", \"_score\": 12.489542, \"_source\": {\"QAs\": [[\"I am painting both the walls and the ceiling of a bedroom. How do I get a nice crisp paint edge between the two?\", \"Painter's tape. Pay for the more expensive variety; it's worth it.\"], [\"I want to rag roll a lighter green over a forest green wall. Will that work? I don't understand about glaze. Is that a separate step?\", \"Yes, it should work fine to put a lighter color over top a darker color. A glaze is a final transparent or semi-transparent layer to protect and make paints shine underneath it. Think of it like a fingernail gloss. In most cases it's a separate step. In this case, your second lighter green may be a glaze if it's thinner and lets the darker show through. \"]], \"articleId\": 92474, \"articleTitle\": \"How to Rag Paint a Wall\", \"articleUrl\": \"https://www.wikihow.com/Rag-Paint-a-Wall\", \"author\": {\"blurb\": null, \"n_coauthors\": 9, \"name\": null}, \"hasParts\": false, \"hasSummary\": true, \"ingredients\": [], \"methods\": [[\"It's important in the process of knowing how to rag paint a wall to have a clear work area.\", \"\", \"\", \"Use latex paint for the base color. This type of paint is easy to work with and to clean up and will provide a smooth base underneath the rag pattern.\\nThe base color latex paint is usually a lighter shade, so the glaze color that is rolled on top with the rag will stand out on top of the base coat.\", \"To prepare, use a separate paint bucket and mix the latex paint with a glaze that is water-based. The glaze will give the wall a soft look and add a sheen.\", \"Allow to dry for 24 hours before adding the rag glaze.\", \"Moisten the rag slightly with water and then dip it into the glaze. Dab the rag onto the wall, making a pattern. Go back in with another rag to dab off excess paint to change the pattern. Experiment.\", \"\", \"\"]], \"methodsHeadlines\": [[\"Prepare the room where you will be painting by removing all furniture (if possible) and other obstacles.\", \"Cover the floor and any large furniture (like couches) that cannot be removed from the room with plastic drop cloths.\", \"Tape edges of the areas you do not wish to be painted to protect the areas from paint splatters and brush edges.\", \"Pour paint for the base color into a paint tray.\", \"Mix the paint for the glaze that will be applied with a rag.\", \"Roll the base color latex paint on the walls, covering the walls completely.\", \"Apply the glaze paint with a rag.\", \"Allow glaze paint to dry.\", \"Wash out rollers and brushes, remove drop cloths, and return furniture to the newly rag-painted room.\"]], \"methodsImages\": [[\"https://www.wikihow.com/images/thumb/f/fd/Rag-Paint-a-Wall-Step-1.jpg/v4-459px-Rag-Paint-a-Wall-Step-1.jpg\", \"https://www.wikihow.com/images/thumb/6/6a/Rag-Paint-a-Wall-Step-2.jpg/v4-459px-Rag-Paint-a-Wall-Step-2.jpg\", \"https://www.wikihow.com/images/thumb/1/1b/Rag-Paint-a-Wall-Step-3.jpg/v4-459px-Rag-Paint-a-Wall-Step-3.jpg\", \"https://www.wikihow.com/images/thumb/d/dc/Rag-Paint-a-Wall-Step-4.jpg/v4-459px-Rag-Paint-a-Wall-Step-4.jpg\", \"https://www.wikihow.com/images/thumb/f/f4/Rag-Paint-a-Wall-Step-5.jpg/v4-459px-Rag-Paint-a-Wall-Step-5.jpg\", \"https://www.wikihow.com/images/thumb/e/e8/Rag-Paint-a-Wall-Step-6.jpg/v4-459px-Rag-Paint-a-Wall-Step-6.jpg\", \"https://www.wikihow.com/images/thumb/7/7a/Rag-Paint-a-Wall-Step-7.jpg/v4-459px-Rag-Paint-a-Wall-Step-7.jpg\", \"https://www.wikihow.com/images/thumb/0/0a/Rag-Paint-a-Wall-Step-8.jpg/v4-459px-Rag-Paint-a-Wall-Step-8.jpg\", \"https://www.wikihow.com/images/thumb/5/59/Rag-Paint-a-Wall-Step-9.jpg/v4-459px-Rag-Paint-a-Wall-Step-9.jpg\"]], \"methodsNames\": [\"\"], \"otherLanguages\": {}, \"quizzes\": [], \"rating\": 92, \"refs\": [\"http://www.ronhazelton.com/archives/howto/rag-roll_painting_techniques.shtm\", \"https://www.bhg.com/decorating/paint/room/how-to-prep-a-room-for-paint-281474979610966/\", \"https://www.thisoldhouse.com/painting/21017299/how-to-prep-a-room-for-paint\", \"https://www.realsimple.com/home-organizing/home-improvement/painting/six-steps-painting-room?slide=40710#40710\", \"https://www.thisoldhouse.com/painting/21015546/how-to-rag-roll-paint-for-an-old-world-look\", \"https://www.youtube.com/watch?v=PZ-XgnFsLNw\", \"https://www.youtube.com/watch?v=PZ-XgnFsLNw\", \"https://www.thisoldhouse.com/painting/21016922/how-to-clean-a-paint-roller\"], \"relatedArticles\": [{\"img\": \"https://www.wikihow.com/images/thumb/9/99/Remove-Paint-Glaze-from-Walls-Step-9.jpg/-crop-342-184-245px-Remove-Paint-Glaze-from-Walls-Step-9.jpg\", \"title\": \"How to Remove Paint Glaze from Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/9/95/Paint-a-Wall-Step-15.jpg/-crop-342-184-245px-Paint-a-Wall-Step-15.jpg\", \"title\": \"How to Paint a Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/8/8d/Choose-an-Accent-Wall-Step-15.jpg/-crop-342-184-245px-Choose-an-Accent-Wall-Step-15.jpg\", \"title\": \"How to Choose an Accent Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fa/Mist-Coat-with-Paint-Step-12.jpg/-crop-342-184-245px-Mist-Coat-with-Paint-Step-12.jpg\", \"title\": \"How to Mist Coat with Paint\"}, {\"img\": null, \"title\": \"How to Paint over Varnish\"}, {\"img\": \"https://www.wikihow.com/images/thumb/4/44/Stain-Brick-Step-16.jpg/-crop-342-184-245px-Stain-Brick-Step-16.jpg\", \"title\": \"How to Stain Brick\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/f0/Skim-Coat-Step-20.jpg/-crop-342-184-245px-Skim-Coat-Step-20.jpg\", \"title\": \"How to Skim Coat\"}, {\"img\": \"https://www.wikihow.com/images/thumb/b/bc/Paint-a-Concrete-Wall-Step-8.jpg/-crop-342-184-295px-Paint-a-Concrete-Wall-Step-8.jpg\", \"title\": \"How to Paint a Concrete Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fb/Paint-Your-Basement-Walls-Step-18.jpg/-crop-342-184-245px-Paint-Your-Basement-Walls-Step-18.jpg\", \"title\": \"How to Paint Your Basement Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/6/65/Paint-Walls-Near-a-Ceiling-Step-20.jpg/-crop-342-184-245px-Paint-Walls-Near-a-Ceiling-Step-20.jpg\", \"title\": \"How to Paint Walls Near a Ceiling\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1b/Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg/-crop-342-184-245px-Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg\", \"title\": \"How to Hide Wall Flaws with Textured Paint\"}, {\"img\": null, \"title\": \"How to Paint an Interior Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/e/ed/Whitewash-Walls-Step-9.jpg/-crop-342-184-245px-Whitewash-Walls-Step-9.jpg\", \"title\": \"How to Whitewash Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/a/a0/Paint-Baseboards-Step-12.jpg/-crop-342-184-245px-Paint-Baseboards-Step-12.jpg\", \"title\": \"How to Paint Baseboards\"}], \"summaryText\": \"Faux finishes that are textured with a rag (in place of a paint brush) add warmth and a sense of detail to a home or office space. This simple brush technique is a way to add an element of design to an interior while staying on a budget. Knowing how to rag paint a wall is a valuable skill for painters interested in transforming an interior space from something plain to a place with character. Follow these steps to learn how to rag paint a wall.\", \"summaryVideoUrl\": null, \"tipsWarnings\": [\"Some painters find it difficult to work with a rag. Some paints stores offer a paint roller cover that has a rag attached to it, to help achieve the rag effect in an easier way.\", \"If you are unhappy with the results of your first rag painting effort, paint over the wall with latex paint and try again.\", \"There are different techniques for rag painting a wall and adding faux finishes. Experiment on butcher paper before you commit to painting a wall to see which techniques you prefer. Different cloths will create different effects. Try out a terry cloth rag, a sponge, or even burlap to test the patterns and pick your favorite.\", \"Experiment with different colors before making the final selection for your room. Study interior design magazines to get a feel for different types of rag paint and faux finishes and to consider all the design possibilities. Some paint stores have paint and glaze in complimentary colors specially picked by designers for this technique.\", \"Paint glaze tends to dry quickly, which can create problems during application, as wet glaze applied over dry glaze creates an unattractive look. A glaze extender paint product is available to help solve the problem.  The extender, which is mixed with the glaze, will slow down drying time to about 10 minutes.\", \"Consider the color of your furniture and any key decorative pieces in the room when choosing your paint colors. Certain paint colors can highlight furnishings in an interesting way.\"], \"tools\": [[\"Drop cloths, plastic or canvas\", \"Bucket to mix the paint\", \"Paint sticks for stirring paint\", \"Masking tape to mask edges (low-tack)\", \"Latex paint for the base coat\", \"Latex paint in highlight color for rag painting\", \"Glaze (water-based)\", \"Cotton rags\"]], \"topLevelCategories\": [\"Home and Garden\", \"DIY\"], \"updated\": \"February 17, 2020\", \"views\": 32539, \"votes\": 26}, \"_type\": \"_doc\", \"original_rank\": 1, \"reranking_score\": 4.420465469360352}, {\"_id\": \"92479\", \"_index\": \"wikihow-v3\", \"_score\": 10.413994, \"_source\": {\"QAs\": [], \"articleId\": 92479, \"articleTitle\": \"How to Paint Panel Walls\", \"articleUrl\": \"https://www.wikihow.com/Paint-Panel-Walls\", \"author\": {\"blurb\": null, \"n_coauthors\": 2, \"name\": \"wikiHow Staff Editor\"}, \"hasParts\": true, \"hasSummary\": true, \"ingredients\": [], \"methods\": [[\"Dip a soft rag in lukewarm water, and then ring it out until it\\u2019s damp, but not soaking wet. Starting at the top of your wall in the corner of the room, wipe down from the ceiling. If you have particularly dirty spots on the wall, you might have to go over it a few times.\\nIf there are stains on your wall, especially any caused by grease, you\\u2019ll need to use a specialized stain remover to get rid of them. Follow the directions on the remover you choose. Once you\\u2019ve removed the other stains, wipe down the walls with a damp rag.\", \"Look for any nail holes or other indents or imperfections in your wall. Fill each of them with spackling compound. Scoop up a bit of compound on your finger, then dab it into the hole. Once the compound is dry, use sandpaper with a medium grit (60 to 100 grit) to sand the compound down until it\\u2019s flush with the wall.\", \"Use a 100-grit sandpaper attached to either a sanding pole, sanding block, or orbital sander to sand your walls. Don\\u2019t sand them all the way down to bare wood \\u2013 just enough to make the surface of the wall feel rough.\\n\\nWear safety glasses and a paper mask that covers your mouth. This will prevent any of the dust from irritating your eyes or lungs.\\nYou might want to put down plastic sheeting or tarps to protect your floor from dust while you sand. You can also tape plastic sheeting or tarps over doorways to prevent dust from escaping and getting into other rooms. You can also cover or remove the room's furniture.\", \"Depending on what color you\\u2019re painting your wood paneling, you might want to repaint your trim as well. Use a 100-grit sandpaper to lightly sand the trim in the room you\\u2019re painting. Then wipe down the trim to remove any loose dust.This will allow you to paint the trim to match the walls.\", \"As the wood paneling ages, it might warp and create gaps between the paneling and the baseboard. You should fill any of these gaps with  caulk. You should also look for gaps around windows and doors, and any other cracks in the wall. Fill each of these with caulk and let it dry completely, at least 12 hours.\", \"You should cover the floor of the room you\\u2019re painting with plastic drop cloths. These are available from most home improvement stores. You can also use plastic tarps if you have any. Use painters tape to create a barrier between where you\\u2019re painting and anywhere you don\\u2019t want paint.\\nWhen you\\u2019re applying the painter\\u2019s tape, make sure you place it right at the edge of where you want the paint to go. For example, if you\\u2019re painting all the way down to the trim, put the painter\\u2019s tape on the very top edge of the trim. This lets you paint the paneling all the way down, but protects your trim.\", \"When you roll the paint onto the wall, you want to make sure that the paint gets into all of the grooves of the paneling. A paint roller with a medium nap should be long enough to do that. Look for rollers with nap that is about \\u20448\\u00a0in (0.95\\u00a0cm) long.\\nYou can get these types of rollers from most home improvement stores. If you\\u2019re unsure about the length of the nap, ask an employee for help.\"], [\"If you have solid wood paneling, you\\u2019ll need to use a water-based primer. It will prevent any damage to the wood. You can find water-based primer at most home improvement stores in the paint section.\\n\\nTo determine if the paneling is solid wood, check the edges. If you see growth rings on the edges of the panels, you have solid wood.\\n\\nYou can choose to use a tinted primer that matches the paint color you\\u2019ve chosen. This can give you a bit more coverage and might mean you don\\u2019t have to use as much paint.\", \"If your paneling is veneer, a shellac-based primer is better. It will help the paint adhere to the paneling better. Most home improvement stores have shellac-based primer in the paint section.\\nYou can tell if your walls are veneer by looking at the grain pattern. If the grain pattern repeats in large sections, it's likely your walls are veneer. Real wood would have a greater variety.\", \"Use a 2\\u00a0in (5.1\\u00a0cm) angled paint brush to cut in the corners of the room. Pour about 2\\u00a0in (5.1\\u00a0cm) of paint into a paint tray or bucket. Dip the brush up to 2/3 of the way into the primer. Then place the longer side of the brush flush against the corner of the wall you\\u2019re painting.\\nIf you're painting the edge of the wall, hold the longer edge of the brush vertically along the edge. If you're painting at the ceiling or baseboard, hold the long edge horizontally against the wall.\", \"With the longer side of the brush flat against the corner of the wall, brush on a 2\\u00a0in (5.1\\u00a0cm) strip of primer. Move vertically along the wall, starting at the top, if you\\u2019re painting the edge of the wall. Paint horizontally if you\\u2019re painting at the top of the wall along ceiling or baseboard.\\n\\nRepeat this process until you\\u2019ve got a 2\\u00a0in (5.1\\u00a0cm)-wide strip of paint all along the edge of the walls and ceiling. This will make it easier to then roll primer onto the rest of the wall.\\nIf you notice that the primer clumping up in the edges between the panels, swipe down the edge with your paintbrush. That should even out the primer.\", \"Once you\\u2019ve cut in the edges and corners, use your roller to apply 2 coats of primer. Pour about 3\\u00a0in (7.6\\u00a0cm) of primer into a paint tray. Then roll your roller into it, coating the whole roller. Roll the roller against the dry ledge of your paint tray to remove excess primer so your roller doesn\\u2019t drip. Then roll the primer onto the wall in vertical strips, making sure to get primer into the edges between the panels.\\nYou\\u2019ll need to let the primer completely dry in between applications. Your can of primer should tell you exactly how long to wait between coats, but it\\u2019s usually at least a couple of hours.\"], [\"Following the same process as with the primer, cut in with your chosen paint color. This will help your paint job look more professional, since you won\\u2019t have to squish your roller into the corners of the room.\\nDepending on the color you\\u2019ve chosen and the original color of your walls, you might need 2 or 3 coats of paint. You should apply this many coats even where you\\u2019re cutting in. Otherwise, the paneling might show through on your edges.\", \"Once you\\u2019re done cutting in the room with paint, you can apply the rest of the paint with a roller. Start at the edge of your cut-ins, and roll on the paint in large vertical strips. Make sure the paint gets into the edges between the paneling.\\nKeep the paint brush you used for cutting in near you during this step. If you notice paint clumping up in the edges between panels, swipe down with the paint brush. This will remove the excess paint and make your wall look smooth.\", \"Sanding the paint job between coats should remove any clumps you couldn\\u2019t get with your paint brush. Wait for your paint job to be completely dry, usually overnight. Use 100-grit sandpaper on a sanding pole or orbital sander to lightly sand the walls. Wipe down the walls with a damp rag after each round of sanding.\\nWear safety glasses and a paper face mask while you sand. They can prevent any dust from getting into your eyes or mouth and irritating you.\", \"It will probably take 2 or 3 coats of paint for the wood paneling to be completely covered. If the paneling is darker, it may take more. Allow the final coat of paint to dry overnight, and then remove any painters' tape and tarps. You can also replace furniture at this point.\"]], \"methodsHeadlines\": [[\"Wipe down the walls.\", \"Fill any nail holes.\", \"Sand the paneling with 100-grit sandpaper.\", \"Sand the trim if you\\u2019re going to paint it.\", \"Caulk cracks at the baseboard and around windows and doors.\", \"Use painters tape and drop cloths to protect the room.\", \"Choose a roller with a medium nap.\"], [\"Use water-based primer for solid wood paneling.\", \"Use a shellac-based primer for veneer paneling.\", \"Prepare to cut in with primer.\", \"Paint a 2 in (5.1 cm) strip of primer.\", \"Roll on 2 coats of primer.\"], [\"Cut in with your choice of paint.\", \"Roll a coat of paint onto the wall.\", \"Let the wall dry completely before lightly sanding it between coats.\", \"Repeat painting and sanding until you have the desired color on your walls.\"]], \"methodsImages\": [[\"https://www.wikihow.com/images/thumb/8/82/Paint-Panel-Walls-Step-1.jpg/v4-460px-Paint-Panel-Walls-Step-1.jpg\", \"https://www.wikihow.com/images/thumb/3/3e/Paint-Panel-Walls-Step-2.jpg/v4-460px-Paint-Panel-Walls-Step-2.jpg\", \"https://www.wikihow.com/images/thumb/c/c3/Paint-Panel-Walls-Step-3.jpg/v4-460px-Paint-Panel-Walls-Step-3.jpg\", \"https://www.wikihow.com/images/thumb/8/88/Paint-Panel-Walls-Step-4.jpg/v4-460px-Paint-Panel-Walls-Step-4.jpg\", \"https://www.wikihow.com/images/thumb/c/c6/Paint-Panel-Walls-Step-5.jpg/v4-460px-Paint-Panel-Walls-Step-5.jpg\", \"https://www.wikihow.com/images/thumb/0/0a/Paint-Panel-Walls-Step-6.jpg/v4-460px-Paint-Panel-Walls-Step-6.jpg\", \"https://www.wikihow.com/images/thumb/f/fd/Paint-Panel-Walls-Step-7.jpg/v4-460px-Paint-Panel-Walls-Step-7.jpg\"], [\"https://www.wikihow.com/images/thumb/e/ec/Paint-Panel-Walls-Step-8.jpg/v4-460px-Paint-Panel-Walls-Step-8.jpg\", \"https://www.wikihow.com/images/thumb/e/e9/Paint-Panel-Walls-Step-9.jpg/v4-460px-Paint-Panel-Walls-Step-9.jpg\", \"https://www.wikihow.com/images/thumb/0/03/Paint-Panel-Walls-Step-10.jpg/v4-460px-Paint-Panel-Walls-Step-10.jpg\", \"https://www.wikihow.com/images/thumb/c/cd/Paint-Panel-Walls-Step-11.jpg/v4-460px-Paint-Panel-Walls-Step-11.jpg\", \"https://www.wikihow.com/images/thumb/b/ba/Paint-Panel-Walls-Step-12.jpg/v4-460px-Paint-Panel-Walls-Step-12.jpg\"], [\"https://www.wikihow.com/images/thumb/1/1f/Paint-Panel-Walls-Step-13.jpg/v4-460px-Paint-Panel-Walls-Step-13.jpg\", \"https://www.wikihow.com/images/thumb/4/4f/Paint-Panel-Walls-Step-14.jpg/v4-460px-Paint-Panel-Walls-Step-14.jpg\", \"https://www.wikihow.com/images/thumb/1/12/Paint-Panel-Walls-Step-15.jpg/v4-460px-Paint-Panel-Walls-Step-15.jpg\", \"https://www.wikihow.com/images/thumb/8/80/Paint-Panel-Walls-Step-16.jpg/v4-460px-Paint-Panel-Walls-Step-16.jpg\"]], \"methodsNames\": [\"Preparing Your Walls for Paint\", \"Priming the Paneling\", \"Painting the Paneling\"], \"otherLanguages\": {\"Espa\\u00f1ol\": {\"title\": \"pintar paneles para pared\", \"url\": \"https://es.wikihow.com/pintar-paneles-para-pared\"}}, \"quizzes\": [], \"rating\": 100, \"refs\": [\"http://www.bhg.com/decorating/home-accessories/wall-art/how-to-paint-wood-paneling/?slideId=0a39661a-94f0-4502-b88e-8a461cfa9218\", \"http://www.bhg.com/decorating/home-accessories/wall-art/how-to-paint-wood-paneling/?slideId=c0451878-1e19-458d-af1d-445ebdabee38\", \"http://www.bhg.com/decorating/home-accessories/wall-art/how-to-paint-wood-paneling/?slideId=f70fecb2-599a-4058-aea8-6e7acea3ca5f\", \"http://www.bhg.com/decorating/home-accessories/wall-art/how-to-paint-wood-paneling/?slideId=073f696e-3ca4-434f-873b-200ffb60afd0\", \"http://www.bhg.com/decorating/home-accessories/wall-art/how-to-paint-wood-paneling/?slideId=91e78217-6706-473c-81de-85ae79e0d64c\", \"http://www.bhg.com/decorating/home-accessories/wall-art/how-to-paint-wood-paneling/?slideId=c54698ac-6abe-4601-9e9c-8dbae4839e4a\", \"http://www.bhg.com/decorating/home-accessories/wall-art/how-to-paint-wood-paneling/?slideId=7e0f28b1-9e7c-45c0-985e-6d7eeb80b021\", \"http://www.wood-database.com/wood-articles/wood-identification-guide/\", \"http://www.wood-database.com/wood-articles/wood-identification-guide/\"], \"relatedArticles\": [{\"img\": \"https://www.wikihow.com/images/thumb/9/95/Paint-a-Wall-Step-15.jpg/-crop-342-184-245px-Paint-a-Wall-Step-15.jpg\", \"title\": \"How to Paint a Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/8/8d/Choose-an-Accent-Wall-Step-15.jpg/-crop-342-184-245px-Choose-an-Accent-Wall-Step-15.jpg\", \"title\": \"How to Choose an Accent Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fa/Mist-Coat-with-Paint-Step-12.jpg/-crop-342-184-245px-Mist-Coat-with-Paint-Step-12.jpg\", \"title\": \"How to Mist Coat with Paint\"}, {\"img\": null, \"title\": \"How to Paint over Varnish\"}, {\"img\": \"https://www.wikihow.com/images/thumb/4/44/Stain-Brick-Step-16.jpg/-crop-342-184-245px-Stain-Brick-Step-16.jpg\", \"title\": \"How to Stain Brick\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/f0/Skim-Coat-Step-20.jpg/-crop-342-184-245px-Skim-Coat-Step-20.jpg\", \"title\": \"How to Skim Coat\"}, {\"img\": \"https://www.wikihow.com/images/thumb/b/bc/Paint-a-Concrete-Wall-Step-8.jpg/-crop-342-184-295px-Paint-a-Concrete-Wall-Step-8.jpg\", \"title\": \"How to Paint a Concrete Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fb/Paint-Your-Basement-Walls-Step-18.jpg/-crop-342-184-245px-Paint-Your-Basement-Walls-Step-18.jpg\", \"title\": \"How to Paint Your Basement Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/6/65/Paint-Walls-Near-a-Ceiling-Step-20.jpg/-crop-342-184-245px-Paint-Walls-Near-a-Ceiling-Step-20.jpg\", \"title\": \"How to Paint Walls Near a Ceiling\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1b/Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg/-crop-342-184-245px-Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg\", \"title\": \"How to Hide Wall Flaws with Textured Paint\"}, {\"img\": null, \"title\": \"How to Paint an Interior Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/e/ed/Whitewash-Walls-Step-9.jpg/-crop-342-184-245px-Whitewash-Walls-Step-9.jpg\", \"title\": \"How to Whitewash Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/a/a0/Paint-Baseboards-Step-12.jpg/-crop-342-184-245px-Paint-Baseboards-Step-12.jpg\", \"title\": \"How to Paint Baseboards\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1c/Emulsion-Walls-Step-19.jpg/-crop-342-184-245px-Emulsion-Walls-Step-19.jpg\", \"title\": \"How to Emulsion Walls\"}], \"summaryText\": \"It can be expensive to remove panel walls or put drywall up over them, but painting them can be a great solution! You\\u2019ll need to prepare the walls for painting by making sure they\\u2019re clean, sanding any finish off the walls, and filling in cracks and holes. Once the walls are prepared, you\\u2019ll need to prime them to ensure the paint sticks. Cut in with a paintbrush first, and then roll primer on the rest of the wall. Once the primer is dry, you repeat the entire process with paint.\", \"summaryVideoUrl\": null, \"tipsWarnings\": [], \"tools\": [], \"topLevelCategories\": [\"Home and Garden\", \"DIY\"], \"updated\": \"March 29, 2019\", \"views\": 2598, \"votes\": 2}, \"_type\": \"_doc\", \"original_rank\": 18, \"reranking_score\": 2.536144256591797}, {\"_id\": \"92472\", \"_index\": \"wikihow-v3\", \"_score\": 12.066477, \"_source\": {\"QAs\": [], \"articleId\": 92472, \"articleTitle\": \"How to Suede Paint a Wall\", \"articleUrl\": \"https://www.wikihow.com/Suede-Paint-a-Wall\", \"author\": {\"blurb\": null, \"n_coauthors\": 1, \"name\": \"wikiHow Staff Editor\"}, \"hasParts\": true, \"hasSummary\": true, \"ingredients\": [], \"methods\": [[\"Paints come in a variety of different categories of \\u201csheen\\u201d or \\u201cfinish,\\u201d which differ in how much light they allow to reflect off a wall. For this project, you\\u2019ll need to buy paint that is specifically designed to have a suede finish.\\n\\nAlthough suede paint is not the most commonly used, you can generally find it at most hardware stores like Home Depot. Ralph Lauren and Valspar both also make their own versions of brushed suede paint.\\n\\nYou can also create a suede finish on your wall by painting a coat of suede paint over a base coat of normal paint that will show through. If you choose to go this route, make sure you buy ordinary paint as well.\", \"If there are popped nails or screws in the wall that you don\\u2019t want to leave in, remove them and fill in the hole with joint or spackling compound. If you come across any exposed drywall, seal it with stain-blocking primer before filling it.\\nTo more easily spot flaws in the wall, turn off the lights, close the curtains, and hold a trouble light close to the wall to better spot holes and cracks.\", \"Remove any protrusions in the wall, and dust the wall from top to bottom to get rid of any dust or dirt before you begin painting.\\n\\nUse sandpaper or a sanding pole to sand the wall from floor to ceiling, focusing especially on areas you had to repair in the previous step.\\n\\nDon\\u2019t apply too much pressure during the sanding process, especially if you\\u2019re using a sanding pole, or else you may inadvertently damage the wall itself.\\n\\nUse a long-reach duster to remove any dust and debris from the wall, including any grit left over from the sanding process.\", \"Before removing any fixtures, shut off the circuit breakers to the room you\\u2019ll be painting in. Using a screwdriver, carefully unscrew the fixtures from the wall and set them aside, storing them together with the screws you just removed. Remove any light fixtures attached to the wall as well.\\n\\nOnce this is done, and any exposed light fixture wires are safely wrapped, you can restore power to the room.\\nFor larger fixtures, you can also cover them in painter\\u2019s plastic to protect them from unwanted paint, securing the plastic in place with painter\\u2019s tape.\", \"Place painter\\u2019s tape over moldings or other surfaces you don\\u2019t want to paint. Press down on the tape with a putty knife to ensure no paint bleeds through to the surface below. Lay a tarp down on the floor where you\\u2019ll be working, and cover any furniture near the wall with painter\\u2019s plastic secured with tape.\\nIf you\\u2019re able to, move furniture out of the room you intend to paint in, to protect it from wayward paint droplets and to give yourself more work space.\", \"Don\\u2019t work directly from the gallon can your paint came in. Instead, mix the paint with a wooden paint stick, and pour about 1 inch (2.5\\u00a0cm) into a paint pail and into a paint tray respectively. This will prevent you from dipping your brush too deeply and will give you a much lighter can of paint to work with.\\nYou will use the paint in the pail when painting with your brush, and use the paint in the tray when painting with your roller.\"], [\"Before you begin painting with the roller, use your brush to first paint those parts of the wall that are too tight for rollers, such as along the ceiling line, molding, and corners of the wall.\\n\\nDip your brush so that about \\u2154 of the bristles are loaded with paint. Paint using horizontal and vertical strokes as you paint alongside the ceiling or the side of the wall, respectively. Your paint strokes should run for roughly 12 inches (30\\u00a0cm) at a time.\\n\\nThe technical term for this part of the painting process is \\u201ccutting in.\\u201d\\n\\nIf you\\u2019re suede painting your wall by painting suede paint over ordinary paint, make sure you\\u2019re using the ordinary paint at this point. You won\\u2019t be using your suede paint until you apply the top coat.\\nUse a slight wiggling motion to apply paint in tight corners or to fill in areas you missed on your first pass.\", \"Start painting in a corner of the wall near the ceiling. Apply the paint in a large \\u201cM\\u201d shape, roughly 3 feet (0.91\\u00a0m) long and 3 feet (0.91\\u00a0m) high, then paint over that M in a vertical rolling motion to ultimately fill in that section of wall. Repeat this process in the adjacent section of the wall, and continue repeating it until the entire wall is painted.\\n\\nAgain, if you\\u2019re suede painting your wall by painting suede paint over ordinary paint, make sure you\\u2019re using the ordinary paint for this part of the process.\\nOnce the base coat has been applied, use the roller to apply another coat, this time only rolling from top to bottom along the entire wall, to smooth out any lap marks.\\n\\nWait 4-6 hours for this base coat to dry before moving on to your top coat.\", \"The technique you use to apply this top coat will be very important; painting with overlapping X\\u2019s will create the variations in color tone typical of a suede finish.\\n\\nStarting in the top left corner of your wall, use your brush to paint an \\u201cX\\u201d shape roughly 1 foot (0.30\\u00a0m) long and 1 foot (0.30\\u00a0m) high. Then fill in the area around this X with more X\\u2019s roughly half as big and slightly overlapping one another.\\n\\nRepeat this process, moving diagonally across the wall in the direction of the bottom right corner, until the entire wall is painted.\\n\\nThe sizes of your X\\u2019s do not need to be precise; in this instance, it\\u2019s more important that you use the proper technique of slightly overlapping X\\u2019s in order to bring about the suede finish.\"]], \"methodsHeadlines\": [[\"Buy suede paint.\", \"Repair any cracks, holes, or other imperfections in the wall.\", \"Make sure the wall is clean and smooth.\", \"Remove fixtures such as outlet plates and switch covers.\", \"Cover any areas you don\\u2019t want to paint.\", \"Mix the paint and put some in a paint pail and paint tray.\"], [\"Paint along the edges of the wall before applying the base coat.\", \"Use your roller to apply the base coat to the rest of the wall.\", \"Use your brush to apply a top coat of suede paint in an X pattern.\"]], \"methodsImages\": [[\"https://www.wikihow.com/images/thumb/3/30/Suede-Paint-a-Wall-Step-1.jpg/v4-460px-Suede-Paint-a-Wall-Step-1.jpg\", \"https://www.wikihow.com/images/thumb/c/c0/Suede-Paint-a-Wall-Step-2.jpg/v4-460px-Suede-Paint-a-Wall-Step-2.jpg\", \"https://www.wikihow.com/images/thumb/6/60/Suede-Paint-a-Wall-Step-3.jpg/v4-460px-Suede-Paint-a-Wall-Step-3.jpg\", \"https://www.wikihow.com/images/thumb/5/54/Suede-Paint-a-Wall-Step-4.jpg/v4-460px-Suede-Paint-a-Wall-Step-4.jpg\", \"https://www.wikihow.com/images/thumb/d/da/Suede-Paint-a-Wall-Step-5.jpg/v4-460px-Suede-Paint-a-Wall-Step-5.jpg\", \"https://www.wikihow.com/images/thumb/a/a2/Suede-Paint-a-Wall-Step-6.jpg/v4-460px-Suede-Paint-a-Wall-Step-6.jpg\"], [\"https://www.wikihow.com/images/thumb/5/5a/Suede-Paint-a-Wall-Step-7.jpg/v4-460px-Suede-Paint-a-Wall-Step-7.jpg\", \"https://www.wikihow.com/images/thumb/2/27/Suede-Paint-a-Wall-Step-8.jpg/v4-460px-Suede-Paint-a-Wall-Step-8.jpg\", \"https://www.wikihow.com/images/thumb/0/0b/Suede-Paint-a-Wall-Step-9.jpg/v4-460px-Suede-Paint-a-Wall-Step-9.jpg\"]], \"methodsNames\": [\"Preparing to Paint\", \"Applying the Paint\"], \"otherLanguages\": {}, \"quizzes\": [], \"rating\": 63, \"refs\": [\"https://www.countryliving.com/home-design/color/g1297/paint-finishes/\", \"http://fauxfinish.weebly.com/how-to-apply-brushed-suede-paint.html\", \"https://www.networx.com/article/suede-faux\", \"https://www.familyhandyman.com/drywall/drywall-repair/preparing-walls-for-painting-problem-walls/view-all/\", \"https://www.familyhandyman.com/drywall/drywall-repair/preparing-walls-for-painting-problem-walls/view-all/\", \"https://www.popularmechanics.com/home/interior-projects/how-to/g151/13-painting-secrets-the-pros-wont-tell-you/\", \"https://www.popularmechanics.com/home/interior-projects/how-to/g151/13-painting-secrets-the-pros-wont-tell-you/\", \"https://www.bhg.com/decorating/paint/how-tos/how-to-ready-a-room/\", \"https://www.builddirect.com/learning-center/old-uncategorized/how-to-paint-a-bathroom-protecting-fixtures/\"], \"relatedArticles\": [{\"img\": \"https://www.wikihow.com/images/thumb/9/95/Paint-a-Wall-Step-15.jpg/-crop-342-184-245px-Paint-a-Wall-Step-15.jpg\", \"title\": \"How to Paint a Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/8/8d/Choose-an-Accent-Wall-Step-15.jpg/-crop-342-184-245px-Choose-an-Accent-Wall-Step-15.jpg\", \"title\": \"How to Choose an Accent Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fa/Mist-Coat-with-Paint-Step-12.jpg/-crop-342-184-245px-Mist-Coat-with-Paint-Step-12.jpg\", \"title\": \"How to Mist Coat with Paint\"}, {\"img\": null, \"title\": \"How to Paint over Varnish\"}, {\"img\": \"https://www.wikihow.com/images/thumb/4/44/Stain-Brick-Step-16.jpg/-crop-342-184-245px-Stain-Brick-Step-16.jpg\", \"title\": \"How to Stain Brick\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/f0/Skim-Coat-Step-20.jpg/-crop-342-184-245px-Skim-Coat-Step-20.jpg\", \"title\": \"How to Skim Coat\"}, {\"img\": \"https://www.wikihow.com/images/thumb/b/bc/Paint-a-Concrete-Wall-Step-8.jpg/-crop-342-184-295px-Paint-a-Concrete-Wall-Step-8.jpg\", \"title\": \"How to Paint a Concrete Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/f/fb/Paint-Your-Basement-Walls-Step-18.jpg/-crop-342-184-245px-Paint-Your-Basement-Walls-Step-18.jpg\", \"title\": \"How to Paint Your Basement Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/6/65/Paint-Walls-Near-a-Ceiling-Step-20.jpg/-crop-342-184-245px-Paint-Walls-Near-a-Ceiling-Step-20.jpg\", \"title\": \"How to Paint Walls Near a Ceiling\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1b/Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg/-crop-342-184-245px-Hide-Wall-Flaws-with-Textured-Paint-Step-9.jpg\", \"title\": \"How to Hide Wall Flaws with Textured Paint\"}, {\"img\": null, \"title\": \"How to Paint an Interior Wall\"}, {\"img\": \"https://www.wikihow.com/images/thumb/e/ed/Whitewash-Walls-Step-9.jpg/-crop-342-184-245px-Whitewash-Walls-Step-9.jpg\", \"title\": \"How to Whitewash Walls\"}, {\"img\": \"https://www.wikihow.com/images/thumb/a/a0/Paint-Baseboards-Step-12.jpg/-crop-342-184-245px-Paint-Baseboards-Step-12.jpg\", \"title\": \"How to Paint Baseboards\"}, {\"img\": \"https://www.wikihow.com/images/thumb/1/1c/Emulsion-Walls-Step-19.jpg/-crop-342-184-245px-Emulsion-Walls-Step-19.jpg\", \"title\": \"How to Emulsion Walls\"}], \"summaryText\": \"Using a suede finish when painting a wall can bring a soft, silky smooth look to the interior of a home. Suede painted walls give a house an elegant and sophisticated look that is simultaneously relaxed and easy on the eyes. Using everyday painting tools and a simple brush technique, you too can bring the velvety and textured look of suede to any room in your home.\", \"summaryVideoUrl\": null, \"tipsWarnings\": [\"Set out to complete your paint job in one session, so that your paint, brush, and roller don\\u2019t dry out.\", \"Make sure you have all the things you\\u2019ll need for this project before you begin.\", \"Make sure you keep the room you\\u2019re painting in well-ventilated throughout your project by keeping doors and windows open.[22]\\nX\\nResearch source\"], \"tools\": [[\"Brushed suede paint\", \"Paint brush\", \"Paint roller\", \"Paint pail\", \"Paint tray\", \"Painter\\u2019s tape\", \"Painter\\u2019s plastic\", \"Sandpaper or a sanding pole\", \"Spackling compound or joint compound\", \"Wooden paint stick\", \"Screwdriver\", \"Tarp\"]], \"topLevelCategories\": [\"Home and Garden\", \"DIY\"], \"updated\": \"March 29, 2019\", \"views\": 6023, \"votes\": 8}, \"_type\": \"_doc\", \"original_rank\": 4, \"reranking_score\": 2.045684814453125}]", "use_evi": "false", "choice_start_idx": "0", "cont_reqs": "0", "current_task": "null", "list_item_selected": "-1", "list_item_rec": "-1", "current_step": "null", "started_cooking": "null", "task_started": "false", "wikihow_summary": "\"\"", "welcome_task": "\"knit a blanket\"", "welcome_recipe": "\"pork ramen\"", "is_wikihow": "true", "first_visit": "false", "proposed_tasks": "[{\"title\": \"How to Paint a Wall\"}, {\"title\": \"How to Paint an Interior Wall\"}, {\"title\": \"How to Prepare a Wall for Paint\"}]"}